RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsi_reg.h
/**
  ******************************************************************************
  * @file    dsi_reg.h
  * @version V1.0
  * @date    2021-09-10
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __DSI_REG_H__
#define __DSI_REG_H__

#include "bl808.h"

/* 0x0 : dsi_config */
#define DSI_CONFIG_OFFSET        (0x0)
#define DSI_CR_HSTX_EN           DSI_CR_HSTX_EN
#define DSI_CR_HSTX_EN_POS       (0U)
#define DSI_CR_HSTX_EN_LEN       (1U)
#define DSI_CR_HSTX_EN_MSK       (((1U << DSI_CR_HSTX_EN_LEN) - 1) << DSI_CR_HSTX_EN_POS)
#define DSI_CR_HSTX_EN_UMSK      (~(((1U << DSI_CR_HSTX_EN_LEN) - 1) << DSI_CR_HSTX_EN_POS))
#define DSI_CR_LANE_NUM          DSI_CR_LANE_NUM
#define DSI_CR_LANE_NUM_POS      (1U)
#define DSI_CR_LANE_NUM_LEN      (2U)
#define DSI_CR_LANE_NUM_MSK      (((1U << DSI_CR_LANE_NUM_LEN) - 1) << DSI_CR_LANE_NUM_POS)
#define DSI_CR_LANE_NUM_UMSK     (~(((1U << DSI_CR_LANE_NUM_LEN) - 1) << DSI_CR_LANE_NUM_POS))
#define DSI_CR_HSTX_MODE         DSI_CR_HSTX_MODE
#define DSI_CR_HSTX_MODE_POS     (4U)
#define DSI_CR_HSTX_MODE_LEN     (1U)
#define DSI_CR_HSTX_MODE_MSK     (((1U << DSI_CR_HSTX_MODE_LEN) - 1) << DSI_CR_HSTX_MODE_POS)
#define DSI_CR_HSTX_MODE_UMSK    (~(((1U << DSI_CR_HSTX_MODE_LEN) - 1) << DSI_CR_HSTX_MODE_POS))
#define DSI_CR_LSE_PKT_EN        DSI_CR_LSE_PKT_EN
#define DSI_CR_LSE_PKT_EN_POS    (5U)
#define DSI_CR_LSE_PKT_EN_LEN    (1U)
#define DSI_CR_LSE_PKT_EN_MSK    (((1U << DSI_CR_LSE_PKT_EN_LEN) - 1) << DSI_CR_LSE_PKT_EN_POS)
#define DSI_CR_LSE_PKT_EN_UMSK   (~(((1U << DSI_CR_LSE_PKT_EN_LEN) - 1) << DSI_CR_LSE_PKT_EN_POS))
#define DSI_CR_LANE_MUX_SEL      DSI_CR_LANE_MUX_SEL
#define DSI_CR_LANE_MUX_SEL_POS  (6U)
#define DSI_CR_LANE_MUX_SEL_LEN  (2U)
#define DSI_CR_LANE_MUX_SEL_MSK  (((1U << DSI_CR_LANE_MUX_SEL_LEN) - 1) << DSI_CR_LANE_MUX_SEL_POS)
#define DSI_CR_LANE_MUX_SEL_UMSK (~(((1U << DSI_CR_LANE_MUX_SEL_LEN) - 1) << DSI_CR_LANE_MUX_SEL_POS))
#define DSI_CR_DT                DSI_CR_DT
#define DSI_CR_DT_POS            (8U)
#define DSI_CR_DT_LEN            (6U)
#define DSI_CR_DT_MSK            (((1U << DSI_CR_DT_LEN) - 1) << DSI_CR_DT_POS)
#define DSI_CR_DT_UMSK           (~(((1U << DSI_CR_DT_LEN) - 1) << DSI_CR_DT_POS))
#define DSI_CR_VC                DSI_CR_VC
#define DSI_CR_VC_POS            (14U)
#define DSI_CR_VC_LEN            (2U)
#define DSI_CR_VC_MSK            (((1U << DSI_CR_VC_LEN) - 1) << DSI_CR_VC_POS)
#define DSI_CR_VC_UMSK           (~(((1U << DSI_CR_VC_LEN) - 1) << DSI_CR_VC_POS))
#define DSI_CR_HSTX_VFP          DSI_CR_HSTX_VFP
#define DSI_CR_HSTX_VFP_POS      (16U)
#define DSI_CR_HSTX_VFP_LEN      (8U)
#define DSI_CR_HSTX_VFP_MSK      (((1U << DSI_CR_HSTX_VFP_LEN) - 1) << DSI_CR_HSTX_VFP_POS)
#define DSI_CR_HSTX_VFP_UMSK     (~(((1U << DSI_CR_HSTX_VFP_LEN) - 1) << DSI_CR_HSTX_VFP_POS))
#define DSI_CR_HSTX_VSA          DSI_CR_HSTX_VSA
#define DSI_CR_HSTX_VSA_POS      (24U)
#define DSI_CR_HSTX_VSA_LEN      (8U)
#define DSI_CR_HSTX_VSA_MSK      (((1U << DSI_CR_HSTX_VSA_LEN) - 1) << DSI_CR_HSTX_VSA_POS)
#define DSI_CR_HSTX_VSA_UMSK     (~(((1U << DSI_CR_HSTX_VSA_LEN) - 1) << DSI_CR_HSTX_VSA_POS))

/* 0x4 : dsi_esc_config */
#define DSI_ESC_CONFIG_OFFSET        (0x4)
#define DSI_CR_ESC_TX_EN             DSI_CR_ESC_TX_EN
#define DSI_CR_ESC_TX_EN_POS         (0U)
#define DSI_CR_ESC_TX_EN_LEN         (1U)
#define DSI_CR_ESC_TX_EN_MSK         (((1U << DSI_CR_ESC_TX_EN_LEN) - 1) << DSI_CR_ESC_TX_EN_POS)
#define DSI_CR_ESC_TX_EN_UMSK        (~(((1U << DSI_CR_ESC_TX_EN_LEN) - 1) << DSI_CR_ESC_TX_EN_POS))
#define DSI_CR_ESC_TX_MODE           DSI_CR_ESC_TX_MODE
#define DSI_CR_ESC_TX_MODE_POS       (1U)
#define DSI_CR_ESC_TX_MODE_LEN       (2U)
#define DSI_CR_ESC_TX_MODE_MSK       (((1U << DSI_CR_ESC_TX_MODE_LEN) - 1) << DSI_CR_ESC_TX_MODE_POS)
#define DSI_CR_ESC_TX_MODE_UMSK      (~(((1U << DSI_CR_ESC_TX_MODE_LEN) - 1) << DSI_CR_ESC_TX_MODE_POS))
#define DSI_CR_ESC_TX_ULPS_EXIT      DSI_CR_ESC_TX_ULPS_EXIT
#define DSI_CR_ESC_TX_ULPS_EXIT_POS  (3U)
#define DSI_CR_ESC_TX_ULPS_EXIT_LEN  (1U)
#define DSI_CR_ESC_TX_ULPS_EXIT_MSK  (((1U << DSI_CR_ESC_TX_ULPS_EXIT_LEN) - 1) << DSI_CR_ESC_TX_ULPS_EXIT_POS)
#define DSI_CR_ESC_TX_ULPS_EXIT_UMSK (~(((1U << DSI_CR_ESC_TX_ULPS_EXIT_LEN) - 1) << DSI_CR_ESC_TX_ULPS_EXIT_POS))
#define DSI_CR_ESC_TX_TRIG           DSI_CR_ESC_TX_TRIG
#define DSI_CR_ESC_TX_TRIG_POS       (4U)
#define DSI_CR_ESC_TX_TRIG_LEN       (4U)
#define DSI_CR_ESC_TX_TRIG_MSK       (((1U << DSI_CR_ESC_TX_TRIG_LEN) - 1) << DSI_CR_ESC_TX_TRIG_POS)
#define DSI_CR_ESC_TX_TRIG_UMSK      (~(((1U << DSI_CR_ESC_TX_TRIG_LEN) - 1) << DSI_CR_ESC_TX_TRIG_POS))
#define DSI_CR_ESC_RX_EN             DSI_CR_ESC_RX_EN
#define DSI_CR_ESC_RX_EN_POS         (16U)
#define DSI_CR_ESC_RX_EN_LEN         (1U)
#define DSI_CR_ESC_RX_EN_MSK         (((1U << DSI_CR_ESC_RX_EN_LEN) - 1) << DSI_CR_ESC_RX_EN_POS)
#define DSI_CR_ESC_RX_EN_UMSK        (~(((1U << DSI_CR_ESC_RX_EN_LEN) - 1) << DSI_CR_ESC_RX_EN_POS))
#define DSI_ST_ESC_RX_LEN            DSI_ST_ESC_RX_LEN
#define DSI_ST_ESC_RX_LEN_POS        (24U)
#define DSI_ST_ESC_RX_LEN_LEN        (8U)
#define DSI_ST_ESC_RX_LEN_MSK        (((1U << DSI_ST_ESC_RX_LEN_LEN) - 1) << DSI_ST_ESC_RX_LEN_POS)
#define DSI_ST_ESC_RX_LEN_UMSK       (~(((1U << DSI_ST_ESC_RX_LEN_LEN) - 1) << DSI_ST_ESC_RX_LEN_POS))

