RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsi_reg.h
/* 0x8 : dsi_lpdt_tx_config */
#define DSI_LPDT_TX_CONFIG_OFFSET (0x8)
#define DSI_CR_LPDT_PDLEN         DSI_CR_LPDT_PDLEN
#define DSI_CR_LPDT_PDLEN_POS     (0U)
#define DSI_CR_LPDT_PDLEN_LEN     (8U)
#define DSI_CR_LPDT_PDLEN_MSK     (((1U << DSI_CR_LPDT_PDLEN_LEN) - 1) << DSI_CR_LPDT_PDLEN_POS)
#define DSI_CR_LPDT_PDLEN_UMSK    (~(((1U << DSI_CR_LPDT_PDLEN_LEN) - 1) << DSI_CR_LPDT_PDLEN_POS))
#define DSI_CR_LPDT_VC            DSI_CR_LPDT_VC
#define DSI_CR_LPDT_VC_POS        (8U)
#define DSI_CR_LPDT_VC_LEN        (2U)
#define DSI_CR_LPDT_VC_MSK        (((1U << DSI_CR_LPDT_VC_LEN) - 1) << DSI_CR_LPDT_VC_POS)
#define DSI_CR_LPDT_VC_UMSK       (~(((1U << DSI_CR_LPDT_VC_LEN) - 1) << DSI_CR_LPDT_VC_POS))
#define DSI_CR_LPDT_DI            DSI_CR_LPDT_DI
#define DSI_CR_LPDT_DI_POS        (10U)
#define DSI_CR_LPDT_DI_LEN        (6U)
#define DSI_CR_LPDT_DI_MSK        (((1U << DSI_CR_LPDT_DI_LEN) - 1) << DSI_CR_LPDT_DI_POS)
#define DSI_CR_LPDT_DI_UMSK       (~(((1U << DSI_CR_LPDT_DI_LEN) - 1) << DSI_CR_LPDT_DI_POS))
#define DSI_CR_LPDT_WORD0         DSI_CR_LPDT_WORD0
#define DSI_CR_LPDT_WORD0_POS     (16U)
#define DSI_CR_LPDT_WORD0_LEN     (8U)
#define DSI_CR_LPDT_WORD0_MSK     (((1U << DSI_CR_LPDT_WORD0_LEN) - 1) << DSI_CR_LPDT_WORD0_POS)
#define DSI_CR_LPDT_WORD0_UMSK    (~(((1U << DSI_CR_LPDT_WORD0_LEN) - 1) << DSI_CR_LPDT_WORD0_POS))
#define DSI_CR_LPDT_WORD1         DSI_CR_LPDT_WORD1
#define DSI_CR_LPDT_WORD1_POS     (24U)
#define DSI_CR_LPDT_WORD1_LEN     (8U)
#define DSI_CR_LPDT_WORD1_MSK     (((1U << DSI_CR_LPDT_WORD1_LEN) - 1) << DSI_CR_LPDT_WORD1_POS)
#define DSI_CR_LPDT_WORD1_UMSK    (~(((1U << DSI_CR_LPDT_WORD1_LEN) - 1) << DSI_CR_LPDT_WORD1_POS))

/* 0xC : dsi_hstx_config */
#define DSI_HSTX_CONFIG_OFFSET  (0xC)
#define DSI_CR_HSTX_PC          DSI_CR_HSTX_PC
#define DSI_CR_HSTX_PC_POS      (0U)
#define DSI_CR_HSTX_PC_LEN      (11U)
#define DSI_CR_HSTX_PC_MSK      (((1U << DSI_CR_HSTX_PC_LEN) - 1) << DSI_CR_HSTX_PC_POS)
#define DSI_CR_HSTX_PC_UMSK     (~(((1U << DSI_CR_HSTX_PC_LEN) - 1) << DSI_CR_HSTX_PC_POS))
#define DSI_CR_HSTX_OUT_TH      DSI_CR_HSTX_OUT_TH
#define DSI_CR_HSTX_OUT_TH_POS  (16U)
#define DSI_CR_HSTX_OUT_TH_LEN  (11U)
#define DSI_CR_HSTX_OUT_TH_MSK  (((1U << DSI_CR_HSTX_OUT_TH_LEN) - 1) << DSI_CR_HSTX_OUT_TH_POS)
#define DSI_CR_HSTX_OUT_TH_UMSK (~(((1U << DSI_CR_HSTX_OUT_TH_LEN) - 1) << DSI_CR_HSTX_OUT_TH_POS))

/* 0x10 : dsi_int_status */
#define DSI_INT_STATUS_OFFSET (0x10)
#define DSI_INT_STATUS        DSI_INT_STATUS
#define DSI_INT_STATUS_POS    (0U)
#define DSI_INT_STATUS_LEN    (14U)
#define DSI_INT_STATUS_MSK    (((1U << DSI_INT_STATUS_LEN) - 1) << DSI_INT_STATUS_POS)
#define DSI_INT_STATUS_UMSK   (~(((1U << DSI_INT_STATUS_LEN) - 1) << DSI_INT_STATUS_POS))

/* 0x14 : dsi_int_mask */
#define DSI_INT_MASK_OFFSET (0x14)
#define DSI_INT_MASK        DSI_INT_MASK
#define DSI_INT_MASK_POS    (0U)
#define DSI_INT_MASK_LEN    (14U)
#define DSI_INT_MASK_MSK    (((1U << DSI_INT_MASK_LEN) - 1) << DSI_INT_MASK_POS)
#define DSI_INT_MASK_UMSK   (~(((1U << DSI_INT_MASK_LEN) - 1) << DSI_INT_MASK_POS))

/* 0x18 : dsi_int_clear */
#define DSI_INT_CLEAR_OFFSET (0x18)
#define DSI_INT_CLEAR        DSI_INT_CLEAR
#define DSI_INT_CLEAR_POS    (0U)
#define DSI_INT_CLEAR_LEN    (14U)
#define DSI_INT_CLEAR_MSK    (((1U << DSI_INT_CLEAR_LEN) - 1) << DSI_INT_CLEAR_POS)
#define DSI_INT_CLEAR_UMSK   (~(((1U << DSI_INT_CLEAR_LEN) - 1) << DSI_INT_CLEAR_POS))

/* 0x1C : dsi_int_enable */
#define DSI_INT_ENABLE_OFFSET (0x1C)
#define DSI_INT_ENABLE        DSI_INT_ENABLE
#define DSI_INT_ENABLE_POS    (0U)
#define DSI_INT_ENABLE_LEN    (14U)
#define DSI_INT_ENABLE_MSK    (((1U << DSI_INT_ENABLE_LEN) - 1) << DSI_INT_ENABLE_POS)
#define DSI_INT_ENABLE_UMSK   (~(((1U << DSI_INT_ENABLE_LEN) - 1) << DSI_INT_ENABLE_POS))

/* 0x20 : dsi_frame_num */
#define DSI_FRAME_NUM_OFFSET  (0x20)
#define DSI_CR_FRAME_NUM      DSI_CR_FRAME_NUM
#define DSI_CR_FRAME_NUM_POS  (0U)
#define DSI_CR_FRAME_NUM_LEN  (16U)
#define DSI_CR_FRAME_NUM_MSK  (((1U << DSI_CR_FRAME_NUM_LEN) - 1) << DSI_CR_FRAME_NUM_POS)
#define DSI_CR_FRAME_NUM_UMSK (~(((1U << DSI_CR_FRAME_NUM_LEN) - 1) << DSI_CR_FRAME_NUM_POS))
#define DSI_CR_FRAME_UPD      DSI_CR_FRAME_UPD
#define DSI_CR_FRAME_UPD_POS  (31U)
#define DSI_CR_FRAME_UPD_LEN  (1U)
#define DSI_CR_FRAME_UPD_MSK  (((1U << DSI_CR_FRAME_UPD_LEN) - 1) << DSI_CR_FRAME_UPD_POS)
#define DSI_CR_FRAME_UPD_UMSK (~(((1U << DSI_CR_FRAME_UPD_LEN) - 1) << DSI_CR_FRAME_UPD_POS))

/* 0x60 : dsi_fifo_config_0 */
#define DSI_FIFO_CONFIG_0_OFFSET   (0x60)
#define DSI_DMA_TX_EN              DSI_DMA_TX_EN
#define DSI_DMA_TX_EN_POS          (0U)
#define DSI_DMA_TX_EN_LEN          (1U)
#define DSI_DMA_TX_EN_MSK          (((1U << DSI_DMA_TX_EN_LEN) - 1) << DSI_DMA_TX_EN_POS)
#define DSI_DMA_TX_EN_UMSK         (~(((1U << DSI_DMA_TX_EN_LEN) - 1) << DSI_DMA_TX_EN_POS))
#define DSI_DMA_RX_EN              DSI_DMA_RX_EN
#define DSI_DMA_RX_EN_POS          (1U)
#define DSI_DMA_RX_EN_LEN          (1U)
#define DSI_DMA_RX_EN_MSK          (((1U << DSI_DMA_RX_EN_LEN) - 1) << DSI_DMA_RX_EN_POS)
#define DSI_DMA_RX_EN_UMSK         (~(((1U << DSI_DMA_RX_EN_LEN) - 1) << DSI_DMA_RX_EN_POS))
#define DSI_TX_FIFO_CLR            DSI_TX_FIFO_CLR
#define DSI_TX_FIFO_CLR_POS        (2U)
#define DSI_TX_FIFO_CLR_LEN        (1U)
#define DSI_TX_FIFO_CLR_MSK        (((1U << DSI_TX_FIFO_CLR_LEN) - 1) << DSI_TX_FIFO_CLR_POS)
#define DSI_TX_FIFO_CLR_UMSK       (~(((1U << DSI_TX_FIFO_CLR_LEN) - 1) << DSI_TX_FIFO_CLR_POS))
#define DSI_RX_FIFO_CLR            DSI_RX_FIFO_CLR
#define DSI_RX_FIFO_CLR_POS        (3U)
#define DSI_RX_FIFO_CLR_LEN        (1U)
#define DSI_RX_FIFO_CLR_MSK        (((1U << DSI_RX_FIFO_CLR_LEN) - 1) << DSI_RX_FIFO_CLR_POS)
#define DSI_RX_FIFO_CLR_UMSK       (~(((1U << DSI_RX_FIFO_CLR_LEN) - 1) << DSI_RX_FIFO_CLR_POS))
#define DSI_TX_FIFO_OVERFLOW       DSI_TX_FIFO_OVERFLOW
#define DSI_TX_FIFO_OVERFLOW_POS   (4U)
#define DSI_TX_FIFO_OVERFLOW_LEN   (1U)
#define DSI_TX_FIFO_OVERFLOW_MSK   (((1U << DSI_TX_FIFO_OVERFLOW_LEN) - 1) << DSI_TX_FIFO_OVERFLOW_POS)
#define DSI_TX_FIFO_OVERFLOW_UMSK  (~(((1U << DSI_TX_FIFO_OVERFLOW_LEN) - 1) << DSI_TX_FIFO_OVERFLOW_POS))
#define DSI_TX_FIFO_UNDERFLOW      DSI_TX_FIFO_UNDERFLOW
#define DSI_TX_FIFO_UNDERFLOW_POS  (5U)
#define DSI_TX_FIFO_UNDERFLOW_LEN  (1U)
#define DSI_TX_FIFO_UNDERFLOW_MSK  (((1U << DSI_TX_FIFO_UNDERFLOW_LEN) - 1) << DSI_TX_FIFO_UNDERFLOW_POS)
#define DSI_TX_FIFO_UNDERFLOW_UMSK (~(((1U << DSI_TX_FIFO_UNDERFLOW_LEN) - 1) << DSI_TX_FIFO_UNDERFLOW_POS))
#define DSI_RX_FIFO_OVERFLOW       DSI_RX_FIFO_OVERFLOW
#define DSI_RX_FIFO_OVERFLOW_POS   (6U)
#define DSI_RX_FIFO_OVERFLOW_LEN   (1U)
#define DSI_RX_FIFO_OVERFLOW_MSK   (((1U << DSI_RX_FIFO_OVERFLOW_LEN) - 1) << DSI_RX_FIFO_OVERFLOW_POS)
#define DSI_RX_FIFO_OVERFLOW_UMSK  (~(((1U << DSI_RX_FIFO_OVERFLOW_LEN) - 1) << DSI_RX_FIFO_OVERFLOW_POS))
#define DSI_RX_FIFO_UNDERFLOW      DSI_RX_FIFO_UNDERFLOW
#define DSI_RX_FIFO_UNDERFLOW_POS  (7U)
#define DSI_RX_FIFO_UNDERFLOW_LEN  (1U)
#define DSI_RX_FIFO_UNDERFLOW_MSK  (((1U << DSI_RX_FIFO_UNDERFLOW_LEN) - 1) << DSI_RX_FIFO_UNDERFLOW_POS)
#define DSI_RX_FIFO_UNDERFLOW_UMSK (~(((1U << DSI_RX_FIFO_UNDERFLOW_LEN) - 1) << DSI_RX_FIFO_UNDERFLOW_POS))

/* 0x64 : dsi_fifo_config_1 */
#define DSI_FIFO_CONFIG_1_OFFSET (0x64)
#define DSI_TX_FIFO_CNT          DSI_TX_FIFO_CNT
#define DSI_TX_FIFO_CNT_POS      (0U)
#define DSI_TX_FIFO_CNT_LEN      (3U)
#define DSI_TX_FIFO_CNT_MSK      (((1U << DSI_TX_FIFO_CNT_LEN) - 1) << DSI_TX_FIFO_CNT_POS)
#define DSI_TX_FIFO_CNT_UMSK     (~(((1U << DSI_TX_FIFO_CNT_LEN) - 1) << DSI_TX_FIFO_CNT_POS))
#define DSI_RX_FIFO_CNT          DSI_RX_FIFO_CNT
#define DSI_RX_FIFO_CNT_POS      (8U)
#define DSI_RX_FIFO_CNT_LEN      (3U)
#define DSI_RX_FIFO_CNT_MSK      (((1U << DSI_RX_FIFO_CNT_LEN) - 1) << DSI_RX_FIFO_CNT_POS)
#define DSI_RX_FIFO_CNT_UMSK     (~(((1U << DSI_RX_FIFO_CNT_LEN) - 1) << DSI_RX_FIFO_CNT_POS))
#define DSI_TX_FIFO_TH           DSI_TX_FIFO_TH
#define DSI_TX_FIFO_TH_POS       (16U)
#define DSI_TX_FIFO_TH_LEN       (2U)
#define DSI_TX_FIFO_TH_MSK       (((1U << DSI_TX_FIFO_TH_LEN) - 1) << DSI_TX_FIFO_TH_POS)
#define DSI_TX_FIFO_TH_UMSK      (~(((1U << DSI_TX_FIFO_TH_LEN) - 1) << DSI_TX_FIFO_TH_POS))
#define DSI_RX_FIFO_TH           DSI_RX_FIFO_TH
#define DSI_RX_FIFO_TH_POS       (24U)
#define DSI_RX_FIFO_TH_LEN       (2U)
#define DSI_RX_FIFO_TH_MSK       (((1U << DSI_RX_FIFO_TH_LEN) - 1) << DSI_RX_FIFO_TH_POS)
#define DSI_RX_FIFO_TH_UMSK      (~(((1U << DSI_RX_FIFO_TH_LEN) - 1) << DSI_RX_FIFO_TH_POS))

/* 0x68 : dsi_fifo_wdata */
#define DSI_FIFO_WDATA_OFFSET (0x68)
#define DSI_FIFO_WDATA        DSI_FIFO_WDATA
#define DSI_FIFO_WDATA_POS    (0U)
#define DSI_FIFO_WDATA_LEN    (32U)
#define DSI_FIFO_WDATA_MSK    (((1U << DSI_FIFO_WDATA_LEN) - 1) << DSI_FIFO_WDATA_POS)
#define DSI_FIFO_WDATA_UMSK   (~(((1U << DSI_FIFO_WDATA_LEN) - 1) << DSI_FIFO_WDATA_POS))

/* 0x6C : dsi_fifo_rdata */
#define DSI_FIFO_RDATA_OFFSET (0x6C)
#define DSI_FIFO_RDATA        DSI_FIFO_RDATA
#define DSI_FIFO_RDATA_POS    (0U)
#define DSI_FIFO_RDATA_LEN    (32U)
#define DSI_FIFO_RDATA_MSK    (((1U << DSI_FIFO_RDATA_LEN) - 1) << DSI_FIFO_RDATA_POS)
#define DSI_FIFO_RDATA_UMSK   (~(((1U << DSI_FIFO_RDATA_LEN) - 1) << DSI_FIFO_RDATA_POS))

/* 0x80 : dphy_config_0 */
#define DSI_DPHY_CONFIG_0_OFFSET     (0x80)
#define DSI_CL_ENABLE                DSI_CL_ENABLE
#define DSI_CL_ENABLE_POS            (0U)
#define DSI_CL_ENABLE_LEN            (1U)
#define DSI_CL_ENABLE_MSK            (((1U << DSI_CL_ENABLE_LEN) - 1) << DSI_CL_ENABLE_POS)
#define DSI_CL_ENABLE_UMSK           (~(((1U << DSI_CL_ENABLE_LEN) - 1) << DSI_CL_ENABLE_POS))
#define DSI_CL_TXREQUESTHS           DSI_CL_TXREQUESTHS
#define DSI_CL_TXREQUESTHS_POS       (1U)
#define DSI_CL_TXREQUESTHS_LEN       (1U)
#define DSI_CL_TXREQUESTHS_MSK       (((1U << DSI_CL_TXREQUESTHS_LEN) - 1) << DSI_CL_TXREQUESTHS_POS)
#define DSI_CL_TXREQUESTHS_UMSK      (~(((1U << DSI_CL_TXREQUESTHS_LEN) - 1) << DSI_CL_TXREQUESTHS_POS))
#define DSI_CL_TXULPSCLK             DSI_CL_TXULPSCLK
#define DSI_CL_TXULPSCLK_POS         (2U)
#define DSI_CL_TXULPSCLK_LEN         (1U)
#define DSI_CL_TXULPSCLK_MSK         (((1U << DSI_CL_TXULPSCLK_LEN) - 1) << DSI_CL_TXULPSCLK_POS)
#define DSI_CL_TXULPSCLK_UMSK        (~(((1U << DSI_CL_TXULPSCLK_LEN) - 1) << DSI_CL_TXULPSCLK_POS))
#define DSI_CL_TXULPSEXIT            DSI_CL_TXULPSEXIT
#define DSI_CL_TXULPSEXIT_POS        (3U)
#define DSI_CL_TXULPSEXIT_LEN        (1U)
#define DSI_CL_TXULPSEXIT_MSK        (((1U << DSI_CL_TXULPSEXIT_LEN) - 1) << DSI_CL_TXULPSEXIT_POS)
#define DSI_CL_TXULPSEXIT_UMSK       (~(((1U << DSI_CL_TXULPSEXIT_LEN) - 1) << DSI_CL_TXULPSEXIT_POS))
#define DSI_CL_STOPSTATE             DSI_CL_STOPSTATE
#define DSI_CL_STOPSTATE_POS         (4U)
#define DSI_CL_STOPSTATE_LEN         (1U)
#define DSI_CL_STOPSTATE_MSK         (((1U << DSI_CL_STOPSTATE_LEN) - 1) << DSI_CL_STOPSTATE_POS)
#define DSI_CL_STOPSTATE_UMSK        (~(((1U << DSI_CL_STOPSTATE_LEN) - 1) << DSI_CL_STOPSTATE_POS))
#define DSI_CL_ULPSACTIVENOT         DSI_CL_ULPSACTIVENOT
#define DSI_CL_ULPSACTIVENOT_POS     (5U)
#define DSI_CL_ULPSACTIVENOT_LEN     (1U)
#define DSI_CL_ULPSACTIVENOT_MSK     (((1U << DSI_CL_ULPSACTIVENOT_LEN) - 1) << DSI_CL_ULPSACTIVENOT_POS)
#define DSI_CL_ULPSACTIVENOT_UMSK    (~(((1U << DSI_CL_ULPSACTIVENOT_LEN) - 1) << DSI_CL_ULPSACTIVENOT_POS))
#define DSI_DL0_ENABLE               DSI_DL0_ENABLE
#define DSI_DL0_ENABLE_POS           (8U)
#define DSI_DL0_ENABLE_LEN           (1U)
#define DSI_DL0_ENABLE_MSK           (((1U << DSI_DL0_ENABLE_LEN) - 1) << DSI_DL0_ENABLE_POS)
#define DSI_DL0_ENABLE_UMSK          (~(((1U << DSI_DL0_ENABLE_LEN) - 1) << DSI_DL0_ENABLE_POS))
#define DSI_DL1_ENABLE               DSI_DL1_ENABLE
#define DSI_DL1_ENABLE_POS           (9U)
#define DSI_DL1_ENABLE_LEN           (1U)
#define DSI_DL1_ENABLE_MSK           (((1U << DSI_DL1_ENABLE_LEN) - 1) << DSI_DL1_ENABLE_POS)
#define DSI_DL1_ENABLE_UMSK          (~(((1U << DSI_DL1_ENABLE_LEN) - 1) << DSI_DL1_ENABLE_POS))
#define DSI_DL2_ENABLE               DSI_DL2_ENABLE
#define DSI_DL2_ENABLE_POS           (10U)
#define DSI_DL2_ENABLE_LEN           (1U)
#define DSI_DL2_ENABLE_MSK           (((1U << DSI_DL2_ENABLE_LEN) - 1) << DSI_DL2_ENABLE_POS)
#define DSI_DL2_ENABLE_UMSK          (~(((1U << DSI_DL2_ENABLE_LEN) - 1) << DSI_DL2_ENABLE_POS))
#define DSI_DL3_ENABLE               DSI_DL3_ENABLE
#define DSI_DL3_ENABLE_POS           (11U)
#define DSI_DL3_ENABLE_LEN           (1U)
#define DSI_DL3_ENABLE_MSK           (((1U << DSI_DL3_ENABLE_LEN) - 1) << DSI_DL3_ENABLE_POS)
#define DSI_DL3_ENABLE_UMSK          (~(((1U << DSI_DL3_ENABLE_LEN) - 1) << DSI_DL3_ENABLE_POS))
#define DSI_DL0_STOPSTATE            DSI_DL0_STOPSTATE
#define DSI_DL0_STOPSTATE_POS        (12U)
#define DSI_DL0_STOPSTATE_LEN        (1U)
#define DSI_DL0_STOPSTATE_MSK        (((1U << DSI_DL0_STOPSTATE_LEN) - 1) << DSI_DL0_STOPSTATE_POS)
#define DSI_DL0_STOPSTATE_UMSK       (~(((1U << DSI_DL0_STOPSTATE_LEN) - 1) << DSI_DL0_STOPSTATE_POS))
#define DSI_DL1_STOPSTATE            DSI_DL1_STOPSTATE
#define DSI_DL1_STOPSTATE_POS        (13U)
#define DSI_DL1_STOPSTATE_LEN        (1U)
#define DSI_DL1_STOPSTATE_MSK        (((1U << DSI_DL1_STOPSTATE_LEN) - 1) << DSI_DL1_STOPSTATE_POS)
#define DSI_DL1_STOPSTATE_UMSK       (~(((1U << DSI_DL1_STOPSTATE_LEN) - 1) << DSI_DL1_STOPSTATE_POS))
#define DSI_DL2_STOPSTATE            DSI_DL2_STOPSTATE
#define DSI_DL2_STOPSTATE_POS        (14U)
#define DSI_DL2_STOPSTATE_LEN        (1U)
#define DSI_DL2_STOPSTATE_MSK        (((1U << DSI_DL2_STOPSTATE_LEN) - 1) << DSI_DL2_STOPSTATE_POS)
#define DSI_DL2_STOPSTATE_UMSK       (~(((1U << DSI_DL2_STOPSTATE_LEN) - 1) << DSI_DL2_STOPSTATE_POS))
#define DSI_DL3_STOPSTATE            DSI_DL3_STOPSTATE
#define DSI_DL3_STOPSTATE_POS        (15U)
#define DSI_DL3_STOPSTATE_LEN        (1U)
#define DSI_DL3_STOPSTATE_MSK        (((1U << DSI_DL3_STOPSTATE_LEN) - 1) << DSI_DL3_STOPSTATE_POS)
#define DSI_DL3_STOPSTATE_UMSK       (~(((1U << DSI_DL3_STOPSTATE_LEN) - 1) << DSI_DL3_STOPSTATE_POS))
#define DSI_DL0_ULPSACTIVENOT        DSI_DL0_ULPSACTIVENOT
#define DSI_DL0_ULPSACTIVENOT_POS    (16U)
#define DSI_DL0_ULPSACTIVENOT_LEN    (1U)
#define DSI_DL0_ULPSACTIVENOT_MSK    (((1U << DSI_DL0_ULPSACTIVENOT_LEN) - 1) << DSI_DL0_ULPSACTIVENOT_POS)
#define DSI_DL0_ULPSACTIVENOT_UMSK   (~(((1U << DSI_DL0_ULPSACTIVENOT_LEN) - 1) << DSI_DL0_ULPSACTIVENOT_POS))
#define DSI_DL1_ULPSACTIVENOT        DSI_DL1_ULPSACTIVENOT
#define DSI_DL1_ULPSACTIVENOT_POS    (17U)
#define DSI_DL1_ULPSACTIVENOT_LEN    (1U)
#define DSI_DL1_ULPSACTIVENOT_MSK    (((1U << DSI_DL1_ULPSACTIVENOT_LEN) - 1) << DSI_DL1_ULPSACTIVENOT_POS)
#define DSI_DL1_ULPSACTIVENOT_UMSK   (~(((1U << DSI_DL1_ULPSACTIVENOT_LEN) - 1) << DSI_DL1_ULPSACTIVENOT_POS))
#define DSI_DL2_ULPSACTIVENOT        DSI_DL2_ULPSACTIVENOT
#define DSI_DL2_ULPSACTIVENOT_POS    (18U)
#define DSI_DL2_ULPSACTIVENOT_LEN    (1U)
#define DSI_DL2_ULPSACTIVENOT_MSK    (((1U << DSI_DL2_ULPSACTIVENOT_LEN) - 1) << DSI_DL2_ULPSACTIVENOT_POS)
#define DSI_DL2_ULPSACTIVENOT_UMSK   (~(((1U << DSI_DL2_ULPSACTIVENOT_LEN) - 1) << DSI_DL2_ULPSACTIVENOT_POS))
#define DSI_DL3_ULPSACTIVENOT        DSI_DL3_ULPSACTIVENOT
#define DSI_DL3_ULPSACTIVENOT_POS    (19U)
#define DSI_DL3_ULPSACTIVENOT_LEN    (1U)
#define DSI_DL3_ULPSACTIVENOT_MSK    (((1U << DSI_DL3_ULPSACTIVENOT_LEN) - 1) << DSI_DL3_ULPSACTIVENOT_POS)
#define DSI_DL3_ULPSACTIVENOT_UMSK   (~(((1U << DSI_DL3_ULPSACTIVENOT_LEN) - 1) << DSI_DL3_ULPSACTIVENOT_POS))
#define DSI_DL0_FORCERXMODE          DSI_DL0_FORCERXMODE
#define DSI_DL0_FORCERXMODE_POS      (20U)
#define DSI_DL0_FORCERXMODE_LEN      (1U)
#define DSI_DL0_FORCERXMODE_MSK      (((1U << DSI_DL0_FORCERXMODE_LEN) - 1) << DSI_DL0_FORCERXMODE_POS)
#define DSI_DL0_FORCERXMODE_UMSK     (~(((1U << DSI_DL0_FORCERXMODE_LEN) - 1) << DSI_DL0_FORCERXMODE_POS))
#define DSI_DL1_FORCERXMODE          DSI_DL1_FORCERXMODE
#define DSI_DL1_FORCERXMODE_POS      (21U)
#define DSI_DL1_FORCERXMODE_LEN      (1U)
#define DSI_DL1_FORCERXMODE_MSK      (((1U << DSI_DL1_FORCERXMODE_LEN) - 1) << DSI_DL1_FORCERXMODE_POS)
#define DSI_DL1_FORCERXMODE_UMSK     (~(((1U << DSI_DL1_FORCERXMODE_LEN) - 1) << DSI_DL1_FORCERXMODE_POS))
#define DSI_DL2_FORCERXMODE          DSI_DL2_FORCERXMODE
#define DSI_DL2_FORCERXMODE_POS      (22U)
#define DSI_DL2_FORCERXMODE_LEN      (1U)
#define DSI_DL2_FORCERXMODE_MSK      (((1U << DSI_DL2_FORCERXMODE_LEN) - 1) << DSI_DL2_FORCERXMODE_POS)
#define DSI_DL2_FORCERXMODE_UMSK     (~(((1U << DSI_DL2_FORCERXMODE_LEN) - 1) << DSI_DL2_FORCERXMODE_POS))
#define DSI_DL3_FORCERXMODE          DSI_DL3_FORCERXMODE
#define DSI_DL3_FORCERXMODE_POS      (23U)
#define DSI_DL3_FORCERXMODE_LEN      (1U)
#define DSI_DL3_FORCERXMODE_MSK      (((1U << DSI_DL3_FORCERXMODE_LEN) - 1) << DSI_DL3_FORCERXMODE_POS)
#define DSI_DL3_FORCERXMODE_UMSK     (~(((1U << DSI_DL3_FORCERXMODE_LEN) - 1) << DSI_DL3_FORCERXMODE_POS))
#define DSI_DL0_FORCETXSTOPMODE      DSI_DL0_FORCETXSTOPMODE
#define DSI_DL0_FORCETXSTOPMODE_POS  (24U)
#define DSI_DL0_FORCETXSTOPMODE_LEN  (1U)
#define DSI_DL0_FORCETXSTOPMODE_MSK  (((1U << DSI_DL0_FORCETXSTOPMODE_LEN) - 1) << DSI_DL0_FORCETXSTOPMODE_POS)
#define DSI_DL0_FORCETXSTOPMODE_UMSK (~(((1U << DSI_DL0_FORCETXSTOPMODE_LEN) - 1) << DSI_DL0_FORCETXSTOPMODE_POS))
#define DSI_DL1_FORCETXSTOPMODE      DSI_DL1_FORCETXSTOPMODE
#define DSI_DL1_FORCETXSTOPMODE_POS  (25U)
#define DSI_DL1_FORCETXSTOPMODE_LEN  (1U)
#define DSI_DL1_FORCETXSTOPMODE_MSK  (((1U << DSI_DL1_FORCETXSTOPMODE_LEN) - 1) << DSI_DL1_FORCETXSTOPMODE_POS)
#define DSI_DL1_FORCETXSTOPMODE_UMSK (~(((1U << DSI_DL1_FORCETXSTOPMODE_LEN) - 1) << DSI_DL1_FORCETXSTOPMODE_POS))
#define DSI_DL2_FORCETXSTOPMODE      DSI_DL2_FORCETXSTOPMODE
#define DSI_DL2_FORCETXSTOPMODE_POS  (26U)
#define DSI_DL2_FORCETXSTOPMODE_LEN  (1U)
#define DSI_DL2_FORCETXSTOPMODE_MSK  (((1U << DSI_DL2_FORCETXSTOPMODE_LEN) - 1) << DSI_DL2_FORCETXSTOPMODE_POS)
#define DSI_DL2_FORCETXSTOPMODE_UMSK (~(((1U << DSI_DL2_FORCETXSTOPMODE_LEN) - 1) << DSI_DL2_FORCETXSTOPMODE_POS))
#define DSI_DL3_FORCETXSTOPMODE      DSI_DL3_FORCETXSTOPMODE
#define DSI_DL3_FORCETXSTOPMODE_POS  (27U)
#define DSI_DL3_FORCETXSTOPMODE_LEN  (1U)
#define DSI_DL3_FORCETXSTOPMODE_MSK  (((1U << DSI_DL3_FORCETXSTOPMODE_LEN) - 1) << DSI_DL3_FORCETXSTOPMODE_POS)
#define DSI_DL3_FORCETXSTOPMODE_UMSK (~(((1U << DSI_DL3_FORCETXSTOPMODE_LEN) - 1) << DSI_DL3_FORCETXSTOPMODE_POS))
#define DSI_DL0_TURNESC              DSI_DL0_TURNESC
#define DSI_DL0_TURNESC_POS          (30U)
#define DSI_DL0_TURNESC_LEN          (1U)
#define DSI_DL0_TURNESC_MSK          (((1U << DSI_DL0_TURNESC_LEN) - 1) << DSI_DL0_TURNESC_POS)
#define DSI_DL0_TURNESC_UMSK         (~(((1U << DSI_DL0_TURNESC_LEN) - 1) << DSI_DL0_TURNESC_POS))
#define DSI_RESET_N                  DSI_RESET_N
#define DSI_RESET_N_POS              (31U)
#define DSI_RESET_N_LEN              (1U)
#define DSI_RESET_N_MSK              (((1U << DSI_RESET_N_LEN) - 1) << DSI_RESET_N_POS)
#define DSI_RESET_N_UMSK             (~(((1U << DSI_RESET_N_LEN) - 1) << DSI_RESET_N_POS))

/* 0x84 : dphy_config_1 */
#define DSI_DPHY_CONFIG_1_OFFSET     (0x84)
#define DSI_REG_TIME_CK_ZERO         DSI_REG_TIME_CK_ZERO
#define DSI_REG_TIME_CK_ZERO_POS     (0U)
#define DSI_REG_TIME_CK_ZERO_LEN     (8U)
#define DSI_REG_TIME_CK_ZERO_MSK     (((1U << DSI_REG_TIME_CK_ZERO_LEN) - 1) << DSI_REG_TIME_CK_ZERO_POS)
#define DSI_REG_TIME_CK_ZERO_UMSK    (~(((1U << DSI_REG_TIME_CK_ZERO_LEN) - 1) << DSI_REG_TIME_CK_ZERO_POS))
#define DSI_REG_TIME_CK_TRAIL        DSI_REG_TIME_CK_TRAIL
#define DSI_REG_TIME_CK_TRAIL_POS    (8U)
#define DSI_REG_TIME_CK_TRAIL_LEN    (8U)
#define DSI_REG_TIME_CK_TRAIL_MSK    (((1U << DSI_REG_TIME_CK_TRAIL_LEN) - 1) << DSI_REG_TIME_CK_TRAIL_POS)
#define DSI_REG_TIME_CK_TRAIL_UMSK   (~(((1U << DSI_REG_TIME_CK_TRAIL_LEN) - 1) << DSI_REG_TIME_CK_TRAIL_POS))
#define DSI_REG_TIME_CK_EXIT         DSI_REG_TIME_CK_EXIT
#define DSI_REG_TIME_CK_EXIT_POS     (16U)
#define DSI_REG_TIME_CK_EXIT_LEN     (8U)
#define DSI_REG_TIME_CK_EXIT_MSK     (((1U << DSI_REG_TIME_CK_EXIT_LEN) - 1) << DSI_REG_TIME_CK_EXIT_POS)
#define DSI_REG_TIME_CK_EXIT_UMSK    (~(((1U << DSI_REG_TIME_CK_EXIT_LEN) - 1) << DSI_REG_TIME_CK_EXIT_POS))
#define DSI_REG_EN_LPRX_AT_ULPS      DSI_REG_EN_LPRX_AT_ULPS
#define DSI_REG_EN_LPRX_AT_ULPS_POS  (24U)
#define DSI_REG_EN_LPRX_AT_ULPS_LEN  (1U)
#define DSI_REG_EN_LPRX_AT_ULPS_MSK  (((1U << DSI_REG_EN_LPRX_AT_ULPS_LEN) - 1) << DSI_REG_EN_LPRX_AT_ULPS_POS)
#define DSI_REG_EN_LPRX_AT_ULPS_UMSK (~(((1U << DSI_REG_EN_LPRX_AT_ULPS_LEN) - 1) << DSI_REG_EN_LPRX_AT_ULPS_POS))

/* 0x88 : dphy_config_2 */
#define DSI_DPHY_CONFIG_2_OFFSET   (0x88)
#define DSI_REG_TIME_HS_ZERO       DSI_REG_TIME_HS_ZERO
#define DSI_REG_TIME_HS_ZERO_POS   (0U)
#define DSI_REG_TIME_HS_ZERO_LEN   (8U)
#define DSI_REG_TIME_HS_ZERO_MSK   (((1U << DSI_REG_TIME_HS_ZERO_LEN) - 1) << DSI_REG_TIME_HS_ZERO_POS)
#define DSI_REG_TIME_HS_ZERO_UMSK  (~(((1U << DSI_REG_TIME_HS_ZERO_LEN) - 1) << DSI_REG_TIME_HS_ZERO_POS))
#define DSI_REG_TIME_HS_TRAIL      DSI_REG_TIME_HS_TRAIL
#define DSI_REG_TIME_HS_TRAIL_POS  (8U)
#define DSI_REG_TIME_HS_TRAIL_LEN  (8U)
#define DSI_REG_TIME_HS_TRAIL_MSK  (((1U << DSI_REG_TIME_HS_TRAIL_LEN) - 1) << DSI_REG_TIME_HS_TRAIL_POS)
#define DSI_REG_TIME_HS_TRAIL_UMSK (~(((1U << DSI_REG_TIME_HS_TRAIL_LEN) - 1) << DSI_REG_TIME_HS_TRAIL_POS))
#define DSI_REG_TIME_HS_PREP       DSI_REG_TIME_HS_PREP
#define DSI_REG_TIME_HS_PREP_POS   (16U)
#define DSI_REG_TIME_HS_PREP_LEN   (8U)
#define DSI_REG_TIME_HS_PREP_MSK   (((1U << DSI_REG_TIME_HS_PREP_LEN) - 1) << DSI_REG_TIME_HS_PREP_POS)
#define DSI_REG_TIME_HS_PREP_UMSK  (~(((1U << DSI_REG_TIME_HS_PREP_LEN) - 1) << DSI_REG_TIME_HS_PREP_POS))
#define DSI_REG_TIME_HS_EXIT       DSI_REG_TIME_HS_EXIT
#define DSI_REG_TIME_HS_EXIT_POS   (24U)
#define DSI_REG_TIME_HS_EXIT_LEN   (8U)
#define DSI_REG_TIME_HS_EXIT_MSK   (((1U << DSI_REG_TIME_HS_EXIT_LEN) - 1) << DSI_REG_TIME_HS_EXIT_POS)
#define DSI_REG_TIME_HS_EXIT_UMSK  (~(((1U << DSI_REG_TIME_HS_EXIT_LEN) - 1) << DSI_REG_TIME_HS_EXIT_POS))

/* 0x8C : dphy_config_3 */
#define DSI_DPHY_CONFIG_3_OFFSET (0x8C)
#define DSI_REG_TIME_TA_GO       DSI_REG_TIME_TA_GO
#define DSI_REG_TIME_TA_GO_POS   (0U)
#define DSI_REG_TIME_TA_GO_LEN   (8U)
#define DSI_REG_TIME_TA_GO_MSK   (((1U << DSI_REG_TIME_TA_GO_LEN) - 1) << DSI_REG_TIME_TA_GO_POS)
#define DSI_REG_TIME_TA_GO_UMSK  (~(((1U << DSI_REG_TIME_TA_GO_LEN) - 1) << DSI_REG_TIME_TA_GO_POS))
#define DSI_REG_TIME_TA_GET      DSI_REG_TIME_TA_GET
#define DSI_REG_TIME_TA_GET_POS  (8U)
#define DSI_REG_TIME_TA_GET_LEN  (8U)
#define DSI_REG_TIME_TA_GET_MSK  (((1U << DSI_REG_TIME_TA_GET_LEN) - 1) << DSI_REG_TIME_TA_GET_POS)
#define DSI_REG_TIME_TA_GET_UMSK (~(((1U << DSI_REG_TIME_TA_GET_LEN) - 1) << DSI_REG_TIME_TA_GET_POS))
#define DSI_REG_TIME_REQRDY      DSI_REG_TIME_REQRDY
#define DSI_REG_TIME_REQRDY_POS  (16U)
#define DSI_REG_TIME_REQRDY_LEN  (8U)
#define DSI_REG_TIME_REQRDY_MSK  (((1U << DSI_REG_TIME_REQRDY_LEN) - 1) << DSI_REG_TIME_REQRDY_POS)
#define DSI_REG_TIME_REQRDY_UMSK (~(((1U << DSI_REG_TIME_REQRDY_LEN) - 1) << DSI_REG_TIME_REQRDY_POS))
#define DSI_REG_TIME_LPX         DSI_REG_TIME_LPX
#define DSI_REG_TIME_LPX_POS     (24U)
#define DSI_REG_TIME_LPX_LEN     (8U)
#define DSI_REG_TIME_LPX_MSK     (((1U << DSI_REG_TIME_LPX_LEN) - 1) << DSI_REG_TIME_LPX_POS)
#define DSI_REG_TIME_LPX_UMSK    (~(((1U << DSI_REG_TIME_LPX_LEN) - 1) << DSI_REG_TIME_LPX_POS))

/* 0x90 : dphy_config_4 */
#define DSI_DPHY_CONFIG_4_OFFSET (0x90)
#define DSI_REG_TIME_WAKEUP      DSI_REG_TIME_WAKEUP
#define DSI_REG_TIME_WAKEUP_POS  (0U)
#define DSI_REG_TIME_WAKEUP_LEN  (16U)
#define DSI_REG_TIME_WAKEUP_MSK  (((1U << DSI_REG_TIME_WAKEUP_LEN) - 1) << DSI_REG_TIME_WAKEUP_POS)
#define DSI_REG_TIME_WAKEUP_UMSK (~(((1U << DSI_REG_TIME_WAKEUP_LEN) - 1) << DSI_REG_TIME_WAKEUP_POS))

