RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsi_reg.h
/* 0x94 : dphy_config_5 */
#define DSI_DPHY_CONFIG_5_OFFSET (0x94)
#define DSI_REG_TRIG3_CODE       DSI_REG_TRIG3_CODE
#define DSI_REG_TRIG3_CODE_POS   (0U)
#define DSI_REG_TRIG3_CODE_LEN   (8U)
#define DSI_REG_TRIG3_CODE_MSK   (((1U << DSI_REG_TRIG3_CODE_LEN) - 1) << DSI_REG_TRIG3_CODE_POS)
#define DSI_REG_TRIG3_CODE_UMSK  (~(((1U << DSI_REG_TRIG3_CODE_LEN) - 1) << DSI_REG_TRIG3_CODE_POS))
#define DSI_REG_TRIG2_CODE       DSI_REG_TRIG2_CODE
#define DSI_REG_TRIG2_CODE_POS   (8U)
#define DSI_REG_TRIG2_CODE_LEN   (8U)
#define DSI_REG_TRIG2_CODE_MSK   (((1U << DSI_REG_TRIG2_CODE_LEN) - 1) << DSI_REG_TRIG2_CODE_POS)
#define DSI_REG_TRIG2_CODE_UMSK  (~(((1U << DSI_REG_TRIG2_CODE_LEN) - 1) << DSI_REG_TRIG2_CODE_POS))
#define DSI_REG_TRIG1_CODE       DSI_REG_TRIG1_CODE
#define DSI_REG_TRIG1_CODE_POS   (16U)
#define DSI_REG_TRIG1_CODE_LEN   (8U)
#define DSI_REG_TRIG1_CODE_MSK   (((1U << DSI_REG_TRIG1_CODE_LEN) - 1) << DSI_REG_TRIG1_CODE_POS)
#define DSI_REG_TRIG1_CODE_UMSK  (~(((1U << DSI_REG_TRIG1_CODE_LEN) - 1) << DSI_REG_TRIG1_CODE_POS))
#define DSI_REG_TRIG0_CODE       DSI_REG_TRIG0_CODE
#define DSI_REG_TRIG0_CODE_POS   (24U)
#define DSI_REG_TRIG0_CODE_LEN   (8U)
#define DSI_REG_TRIG0_CODE_MSK   (((1U << DSI_REG_TRIG0_CODE_LEN) - 1) << DSI_REG_TRIG0_CODE_POS)
#define DSI_REG_TRIG0_CODE_UMSK  (~(((1U << DSI_REG_TRIG0_CODE_LEN) - 1) << DSI_REG_TRIG0_CODE_POS))

/* 0x98 : dphy_config_6 */
#define DSI_DPHY_CONFIG_6_OFFSET (0x98)
#define DSI_REG_ULPS_CODE        DSI_REG_ULPS_CODE
#define DSI_REG_ULPS_CODE_POS    (0U)
#define DSI_REG_ULPS_CODE_LEN    (8U)
#define DSI_REG_ULPS_CODE_MSK    (((1U << DSI_REG_ULPS_CODE_LEN) - 1) << DSI_REG_ULPS_CODE_POS)
#define DSI_REG_ULPS_CODE_UMSK   (~(((1U << DSI_REG_ULPS_CODE_LEN) - 1) << DSI_REG_ULPS_CODE_POS))
#define DSI_REG_LPDT_CODE        DSI_REG_LPDT_CODE
#define DSI_REG_LPDT_CODE_POS    (8U)
#define DSI_REG_LPDT_CODE_LEN    (8U)
#define DSI_REG_LPDT_CODE_MSK    (((1U << DSI_REG_LPDT_CODE_LEN) - 1) << DSI_REG_LPDT_CODE_POS)
#define DSI_REG_LPDT_CODE_UMSK   (~(((1U << DSI_REG_LPDT_CODE_LEN) - 1) << DSI_REG_LPDT_CODE_POS))

/* 0x9C : dphy_config_7 */
#define DSI_DPHY_CONFIG_7_OFFSET                 (0x9C)
#define DSI_REG_ANA_TEST_EN                      DSI_REG_ANA_TEST_EN
#define DSI_REG_ANA_TEST_EN_POS                  (0U)
#define DSI_REG_ANA_TEST_EN_LEN                  (1U)
#define DSI_REG_ANA_TEST_EN_MSK                  (((1U << DSI_REG_ANA_TEST_EN_LEN) - 1) << DSI_REG_ANA_TEST_EN_POS)
#define DSI_REG_ANA_TEST_EN_UMSK                 (~(((1U << DSI_REG_ANA_TEST_EN_LEN) - 1) << DSI_REG_ANA_TEST_EN_POS))
#define DSI_REG_PT_EN                            DSI_REG_PT_EN
#define DSI_REG_PT_EN_POS                        (1U)
#define DSI_REG_PT_EN_LEN                        (1U)
#define DSI_REG_PT_EN_MSK                        (((1U << DSI_REG_PT_EN_LEN) - 1) << DSI_REG_PT_EN_POS)
#define DSI_REG_PT_EN_UMSK                       (~(((1U << DSI_REG_PT_EN_LEN) - 1) << DSI_REG_PT_EN_POS))
#define DSI_REG_PT_LP_MODE                       DSI_REG_PT_LP_MODE
#define DSI_REG_PT_LP_MODE_POS                   (2U)
#define DSI_REG_PT_LP_MODE_LEN                   (1U)
#define DSI_REG_PT_LP_MODE_MSK                   (((1U << DSI_REG_PT_LP_MODE_LEN) - 1) << DSI_REG_PT_LP_MODE_POS)
#define DSI_REG_PT_LP_MODE_UMSK                  (~(((1U << DSI_REG_PT_LP_MODE_LEN) - 1) << DSI_REG_PT_LP_MODE_POS))
#define DSI_REG_PT_PRBS_OR_JITT                  DSI_REG_PT_PRBS_OR_JITT
#define DSI_REG_PT_PRBS_OR_JITT_POS              (3U)
#define DSI_REG_PT_PRBS_OR_JITT_LEN              (1U)
#define DSI_REG_PT_PRBS_OR_JITT_MSK              (((1U << DSI_REG_PT_PRBS_OR_JITT_LEN) - 1) << DSI_REG_PT_PRBS_OR_JITT_POS)
#define DSI_REG_PT_PRBS_OR_JITT_UMSK             (~(((1U << DSI_REG_PT_PRBS_OR_JITT_LEN) - 1) << DSI_REG_PT_PRBS_OR_JITT_POS))
#define DSI_REG_FORCE_HIZ_LP                     DSI_REG_FORCE_HIZ_LP
#define DSI_REG_FORCE_HIZ_LP_POS                 (4U)
#define DSI_REG_FORCE_HIZ_LP_LEN                 (4U)
#define DSI_REG_FORCE_HIZ_LP_MSK                 (((1U << DSI_REG_FORCE_HIZ_LP_LEN) - 1) << DSI_REG_FORCE_HIZ_LP_POS)
#define DSI_REG_FORCE_HIZ_LP_UMSK                (~(((1U << DSI_REG_FORCE_HIZ_LP_LEN) - 1) << DSI_REG_FORCE_HIZ_LP_POS))
#define DSI_REG_FORCE_HIZ_HS                     DSI_REG_FORCE_HIZ_HS
#define DSI_REG_FORCE_HIZ_HS_POS                 (8U)
#define DSI_REG_FORCE_HIZ_HS_LEN                 (4U)
#define DSI_REG_FORCE_HIZ_HS_MSK                 (((1U << DSI_REG_FORCE_HIZ_HS_LEN) - 1) << DSI_REG_FORCE_HIZ_HS_POS)
#define DSI_REG_FORCE_HIZ_HS_UMSK                (~(((1U << DSI_REG_FORCE_HIZ_HS_LEN) - 1) << DSI_REG_FORCE_HIZ_HS_POS))
#define DSI_REG_FORCE_CLK_HIZ_LP                 DSI_REG_FORCE_CLK_HIZ_LP
#define DSI_REG_FORCE_CLK_HIZ_LP_POS             (12U)
#define DSI_REG_FORCE_CLK_HIZ_LP_LEN             (1U)
#define DSI_REG_FORCE_CLK_HIZ_LP_MSK             (((1U << DSI_REG_FORCE_CLK_HIZ_LP_LEN) - 1) << DSI_REG_FORCE_CLK_HIZ_LP_POS)
#define DSI_REG_FORCE_CLK_HIZ_LP_UMSK            (~(((1U << DSI_REG_FORCE_CLK_HIZ_LP_LEN) - 1) << DSI_REG_FORCE_CLK_HIZ_LP_POS))
#define DSI_REG_FORCE_CLK_HIZ_HS                 DSI_REG_FORCE_CLK_HIZ_HS
#define DSI_REG_FORCE_CLK_HIZ_HS_POS             (13U)
#define DSI_REG_FORCE_CLK_HIZ_HS_LEN             (1U)
#define DSI_REG_FORCE_CLK_HIZ_HS_MSK             (((1U << DSI_REG_FORCE_CLK_HIZ_HS_LEN) - 1) << DSI_REG_FORCE_CLK_HIZ_HS_POS)
#define DSI_REG_FORCE_CLK_HIZ_HS_UMSK            (~(((1U << DSI_REG_FORCE_CLK_HIZ_HS_LEN) - 1) << DSI_REG_FORCE_CLK_HIZ_HS_POS))
#define DSI_REG_ANA_LP_TXEN_CLKLANE_ESC          DSI_REG_ANA_LP_TXEN_CLKLANE_ESC
#define DSI_REG_ANA_LP_TXEN_CLKLANE_ESC_POS      (14U)
#define DSI_REG_ANA_LP_TXEN_CLKLANE_ESC_LEN      (1U)
#define DSI_REG_ANA_LP_TXEN_CLKLANE_ESC_MSK      (((1U << DSI_REG_ANA_LP_TXEN_CLKLANE_ESC_LEN) - 1) << DSI_REG_ANA_LP_TXEN_CLKLANE_ESC_POS)
#define DSI_REG_ANA_LP_TXEN_CLKLANE_ESC_UMSK     (~(((1U << DSI_REG_ANA_LP_TXEN_CLKLANE_ESC_LEN) - 1) << DSI_REG_ANA_LP_TXEN_CLKLANE_ESC_POS))
#define DSI_REG_ANA_LP_DPTXDATA_CLKLANE_ESC      DSI_REG_ANA_LP_DPTXDATA_CLKLANE_ESC
#define DSI_REG_ANA_LP_DPTXDATA_CLKLANE_ESC_POS  (15U)
#define DSI_REG_ANA_LP_DPTXDATA_CLKLANE_ESC_LEN  (1U)
#define DSI_REG_ANA_LP_DPTXDATA_CLKLANE_ESC_MSK  (((1U << DSI_REG_ANA_LP_DPTXDATA_CLKLANE_ESC_LEN) - 1) << DSI_REG_ANA_LP_DPTXDATA_CLKLANE_ESC_POS)
#define DSI_REG_ANA_LP_DPTXDATA_CLKLANE_ESC_UMSK (~(((1U << DSI_REG_ANA_LP_DPTXDATA_CLKLANE_ESC_LEN) - 1) << DSI_REG_ANA_LP_DPTXDATA_CLKLANE_ESC_POS))
#define DSI_REG_ANA_LP_DNTXDATA_CLKLANE_ESC      DSI_REG_ANA_LP_DNTXDATA_CLKLANE_ESC
#define DSI_REG_ANA_LP_DNTXDATA_CLKLANE_ESC_POS  (16U)
#define DSI_REG_ANA_LP_DNTXDATA_CLKLANE_ESC_LEN  (1U)
#define DSI_REG_ANA_LP_DNTXDATA_CLKLANE_ESC_MSK  (((1U << DSI_REG_ANA_LP_DNTXDATA_CLKLANE_ESC_LEN) - 1) << DSI_REG_ANA_LP_DNTXDATA_CLKLANE_ESC_POS)
#define DSI_REG_ANA_LP_DNTXDATA_CLKLANE_ESC_UMSK (~(((1U << DSI_REG_ANA_LP_DNTXDATA_CLKLANE_ESC_LEN) - 1) << DSI_REG_ANA_LP_DNTXDATA_CLKLANE_ESC_POS))
#define DSI_REG_ANA_HS_TXEN_CLKLANE_ESC          DSI_REG_ANA_HS_TXEN_CLKLANE_ESC
#define DSI_REG_ANA_HS_TXEN_CLKLANE_ESC_POS      (17U)
#define DSI_REG_ANA_HS_TXEN_CLKLANE_ESC_LEN      (1U)
#define DSI_REG_ANA_HS_TXEN_CLKLANE_ESC_MSK      (((1U << DSI_REG_ANA_HS_TXEN_CLKLANE_ESC_LEN) - 1) << DSI_REG_ANA_HS_TXEN_CLKLANE_ESC_POS)
#define DSI_REG_ANA_HS_TXEN_CLKLANE_ESC_UMSK     (~(((1U << DSI_REG_ANA_HS_TXEN_CLKLANE_ESC_LEN) - 1) << DSI_REG_ANA_HS_TXEN_CLKLANE_ESC_POS))
#define DSI_REG_ANA_CLK_EN_ESC                   DSI_REG_ANA_CLK_EN_ESC
#define DSI_REG_ANA_CLK_EN_ESC_POS               (18U)
#define DSI_REG_ANA_CLK_EN_ESC_LEN               (1U)
#define DSI_REG_ANA_CLK_EN_ESC_MSK               (((1U << DSI_REG_ANA_CLK_EN_ESC_LEN) - 1) << DSI_REG_ANA_CLK_EN_ESC_POS)
#define DSI_REG_ANA_CLK_EN_ESC_UMSK              (~(((1U << DSI_REG_ANA_CLK_EN_ESC_LEN) - 1) << DSI_REG_ANA_CLK_EN_ESC_POS))
#define DSI_REG_ANA_BYTE_REV                     DSI_REG_ANA_BYTE_REV
#define DSI_REG_ANA_BYTE_REV_POS                 (19U)
#define DSI_REG_ANA_BYTE_REV_LEN                 (1U)
#define DSI_REG_ANA_BYTE_REV_MSK                 (((1U << DSI_REG_ANA_BYTE_REV_LEN) - 1) << DSI_REG_ANA_BYTE_REV_POS)
#define DSI_REG_ANA_BYTE_REV_UMSK                (~(((1U << DSI_REG_ANA_BYTE_REV_LEN) - 1) << DSI_REG_ANA_BYTE_REV_POS))

/* 0xA0 : dphy_config_8 */
#define DSI_DPHY_CONFIG_8_OFFSET         (0xA0)
#define DSI_REG_ANA_LPTXP_DATA           DSI_REG_ANA_LPTXP_DATA
#define DSI_REG_ANA_LPTXP_DATA_POS       (0U)
#define DSI_REG_ANA_LPTXP_DATA_LEN       (4U)
#define DSI_REG_ANA_LPTXP_DATA_MSK       (((1U << DSI_REG_ANA_LPTXP_DATA_LEN) - 1) << DSI_REG_ANA_LPTXP_DATA_POS)
#define DSI_REG_ANA_LPTXP_DATA_UMSK      (~(((1U << DSI_REG_ANA_LPTXP_DATA_LEN) - 1) << DSI_REG_ANA_LPTXP_DATA_POS))
#define DSI_REG_ANA_LPTXN_DATA           DSI_REG_ANA_LPTXN_DATA
#define DSI_REG_ANA_LPTXN_DATA_POS       (4U)
#define DSI_REG_ANA_LPTXN_DATA_LEN       (4U)
#define DSI_REG_ANA_LPTXN_DATA_MSK       (((1U << DSI_REG_ANA_LPTXN_DATA_LEN) - 1) << DSI_REG_ANA_LPTXN_DATA_POS)
#define DSI_REG_ANA_LPTXN_DATA_UMSK      (~(((1U << DSI_REG_ANA_LPTXN_DATA_LEN) - 1) << DSI_REG_ANA_LPTXN_DATA_POS))
#define DSI_REG_ANA_LPTXEN               DSI_REG_ANA_LPTXEN
#define DSI_REG_ANA_LPTXEN_POS           (8U)
#define DSI_REG_ANA_LPTXEN_LEN           (4U)
#define DSI_REG_ANA_LPTXEN_MSK           (((1U << DSI_REG_ANA_LPTXEN_LEN) - 1) << DSI_REG_ANA_LPTXEN_POS)
#define DSI_REG_ANA_LPTXEN_UMSK          (~(((1U << DSI_REG_ANA_LPTXEN_LEN) - 1) << DSI_REG_ANA_LPTXEN_POS))
#define DSI_REG_ANA_LPRXEN               DSI_REG_ANA_LPRXEN
#define DSI_REG_ANA_LPRXEN_POS           (12U)
#define DSI_REG_ANA_LPRXEN_LEN           (4U)
#define DSI_REG_ANA_LPRXEN_MSK           (((1U << DSI_REG_ANA_LPRXEN_LEN) - 1) << DSI_REG_ANA_LPRXEN_POS)
#define DSI_REG_ANA_LPRXEN_UMSK          (~(((1U << DSI_REG_ANA_LPRXEN_LEN) - 1) << DSI_REG_ANA_LPRXEN_POS))
#define DSI_REG_ANA_HSTXEN               DSI_REG_ANA_HSTXEN
#define DSI_REG_ANA_HSTXEN_POS           (16U)
#define DSI_REG_ANA_HSTXEN_LEN           (4U)
#define DSI_REG_ANA_HSTXEN_MSK           (((1U << DSI_REG_ANA_HSTXEN_LEN) - 1) << DSI_REG_ANA_HSTXEN_POS)
#define DSI_REG_ANA_HSTXEN_UMSK          (~(((1U << DSI_REG_ANA_HSTXEN_LEN) - 1) << DSI_REG_ANA_HSTXEN_POS))
#define DSI_REG_ANA_HS_TRAIL_BYTE        DSI_REG_ANA_HS_TRAIL_BYTE
#define DSI_REG_ANA_HS_TRAIL_BYTE_POS    (20U)
#define DSI_REG_ANA_HS_TRAIL_BYTE_LEN    (4U)
#define DSI_REG_ANA_HS_TRAIL_BYTE_MSK    (((1U << DSI_REG_ANA_HS_TRAIL_BYTE_LEN) - 1) << DSI_REG_ANA_HS_TRAIL_BYTE_POS)
#define DSI_REG_ANA_HS_TRAIL_BYTE_UMSK   (~(((1U << DSI_REG_ANA_HS_TRAIL_BYTE_LEN) - 1) << DSI_REG_ANA_HS_TRAIL_BYTE_POS))
#define DSI_REG_ANA_HS_SYNC_LD_BYTE      DSI_REG_ANA_HS_SYNC_LD_BYTE
#define DSI_REG_ANA_HS_SYNC_LD_BYTE_POS  (24U)
#define DSI_REG_ANA_HS_SYNC_LD_BYTE_LEN  (4U)
#define DSI_REG_ANA_HS_SYNC_LD_BYTE_MSK  (((1U << DSI_REG_ANA_HS_SYNC_LD_BYTE_LEN) - 1) << DSI_REG_ANA_HS_SYNC_LD_BYTE_POS)
#define DSI_REG_ANA_HS_SYNC_LD_BYTE_UMSK (~(((1U << DSI_REG_ANA_HS_SYNC_LD_BYTE_LEN) - 1) << DSI_REG_ANA_HS_SYNC_LD_BYTE_POS))
#define DSI_REG_ANA_HS_P2S_SEL_BYTE      DSI_REG_ANA_HS_P2S_SEL_BYTE
#define DSI_REG_ANA_HS_P2S_SEL_BYTE_POS  (28U)
#define DSI_REG_ANA_HS_P2S_SEL_BYTE_LEN  (4U)
#define DSI_REG_ANA_HS_P2S_SEL_BYTE_MSK  (((1U << DSI_REG_ANA_HS_P2S_SEL_BYTE_LEN) - 1) << DSI_REG_ANA_HS_P2S_SEL_BYTE_POS)
#define DSI_REG_ANA_HS_P2S_SEL_BYTE_UMSK (~(((1U << DSI_REG_ANA_HS_P2S_SEL_BYTE_LEN) - 1) << DSI_REG_ANA_HS_P2S_SEL_BYTE_POS))

/* 0xA4 : dphy_config_9 */
#define DSI_DPHY_CONFIG_9_OFFSET          (0xA4)
#define DSI_REG_ANA_HS_DATA_OUT_BYTE      DSI_REG_ANA_HS_DATA_OUT_BYTE
#define DSI_REG_ANA_HS_DATA_OUT_BYTE_POS  (0U)
#define DSI_REG_ANA_HS_DATA_OUT_BYTE_LEN  (32U)
#define DSI_REG_ANA_HS_DATA_OUT_BYTE_MSK  (((1U << DSI_REG_ANA_HS_DATA_OUT_BYTE_LEN) - 1) << DSI_REG_ANA_HS_DATA_OUT_BYTE_POS)
#define DSI_REG_ANA_HS_DATA_OUT_BYTE_UMSK (~(((1U << DSI_REG_ANA_HS_DATA_OUT_BYTE_LEN) - 1) << DSI_REG_ANA_HS_DATA_OUT_BYTE_POS))

/* 0xA8 : dphy_config_10 */
#define DSI_DPHY_CONFIG_10_OFFSET           (0xA8)
#define DSI_REG_TESTBUS_SEL_LO              DSI_REG_TESTBUS_SEL_LO
#define DSI_REG_TESTBUS_SEL_LO_POS          (0U)
#define DSI_REG_TESTBUS_SEL_LO_LEN          (4U)
#define DSI_REG_TESTBUS_SEL_LO_MSK          (((1U << DSI_REG_TESTBUS_SEL_LO_LEN) - 1) << DSI_REG_TESTBUS_SEL_LO_POS)
#define DSI_REG_TESTBUS_SEL_LO_UMSK         (~(((1U << DSI_REG_TESTBUS_SEL_LO_LEN) - 1) << DSI_REG_TESTBUS_SEL_LO_POS))
#define DSI_REG_TESTBUS_SEL_HI              DSI_REG_TESTBUS_SEL_HI
#define DSI_REG_TESTBUS_SEL_HI_POS          (4U)
#define DSI_REG_TESTBUS_SEL_HI_LEN          (4U)
#define DSI_REG_TESTBUS_SEL_HI_MSK          (((1U << DSI_REG_TESTBUS_SEL_HI_LEN) - 1) << DSI_REG_TESTBUS_SEL_HI_POS)
#define DSI_REG_TESTBUS_SEL_HI_UMSK         (~(((1U << DSI_REG_TESTBUS_SEL_HI_LEN) - 1) << DSI_REG_TESTBUS_SEL_HI_POS))
#define DSI_REG_TESTBUS_HI8BSEL_8BMODE      DSI_REG_TESTBUS_HI8BSEL_8BMODE
#define DSI_REG_TESTBUS_HI8BSEL_8BMODE_POS  (8U)
#define DSI_REG_TESTBUS_HI8BSEL_8BMODE_LEN  (1U)
#define DSI_REG_TESTBUS_HI8BSEL_8BMODE_MSK  (((1U << DSI_REG_TESTBUS_HI8BSEL_8BMODE_LEN) - 1) << DSI_REG_TESTBUS_HI8BSEL_8BMODE_POS)
#define DSI_REG_TESTBUS_HI8BSEL_8BMODE_UMSK (~(((1U << DSI_REG_TESTBUS_HI8BSEL_8BMODE_LEN) - 1) << DSI_REG_TESTBUS_HI8BSEL_8BMODE_POS))
#define DSI_REG_IMP_PU_CODE                 DSI_REG_IMP_PU_CODE
#define DSI_REG_IMP_PU_CODE_POS             (9U)
#define DSI_REG_IMP_PU_CODE_LEN             (5U)
#define DSI_REG_IMP_PU_CODE_MSK             (((1U << DSI_REG_IMP_PU_CODE_LEN) - 1) << DSI_REG_IMP_PU_CODE_POS)
#define DSI_REG_IMP_PU_CODE_UMSK            (~(((1U << DSI_REG_IMP_PU_CODE_LEN) - 1) << DSI_REG_IMP_PU_CODE_POS))
#define DSI_REG_IMP_PD_CODE                 DSI_REG_IMP_PD_CODE
#define DSI_REG_IMP_PD_CODE_POS             (14U)
#define DSI_REG_IMP_PD_CODE_LEN             (5U)
#define DSI_REG_IMP_PD_CODE_MSK             (((1U << DSI_REG_IMP_PD_CODE_LEN) - 1) << DSI_REG_IMP_PD_CODE_POS)
#define DSI_REG_IMP_PD_CODE_UMSK            (~(((1U << DSI_REG_IMP_PD_CODE_LEN) - 1) << DSI_REG_IMP_PD_CODE_POS))
#define DSI_REG_DPHY_VREG400MV_TRIM         DSI_REG_DPHY_VREG400MV_TRIM
#define DSI_REG_DPHY_VREG400MV_TRIM_POS     (19U)
#define DSI_REG_DPHY_VREG400MV_TRIM_LEN     (3U)
#define DSI_REG_DPHY_VREG400MV_TRIM_MSK     (((1U << DSI_REG_DPHY_VREG400MV_TRIM_LEN) - 1) << DSI_REG_DPHY_VREG400MV_TRIM_POS)
#define DSI_REG_DPHY_VREG400MV_TRIM_UMSK    (~(((1U << DSI_REG_DPHY_VREG400MV_TRIM_LEN) - 1) << DSI_REG_DPHY_VREG400MV_TRIM_POS))
#define DSI_REG_DPHY_BG_VREF_EN             DSI_REG_DPHY_BG_VREF_EN
#define DSI_REG_DPHY_BG_VREF_EN_POS         (22U)
#define DSI_REG_DPHY_BG_VREF_EN_LEN         (1U)
#define DSI_REG_DPHY_BG_VREF_EN_MSK         (((1U << DSI_REG_DPHY_BG_VREF_EN_LEN) - 1) << DSI_REG_DPHY_BG_VREF_EN_POS)
#define DSI_REG_DPHY_BG_VREF_EN_UMSK        (~(((1U << DSI_REG_DPHY_BG_VREF_EN_LEN) - 1) << DSI_REG_DPHY_BG_VREF_EN_POS))
#define DSI_REG_ANA_BG_VREF_EN              DSI_REG_ANA_BG_VREF_EN
#define DSI_REG_ANA_BG_VREF_EN_POS          (23U)
#define DSI_REG_ANA_BG_VREF_EN_LEN          (1U)
#define DSI_REG_ANA_BG_VREF_EN_MSK          (((1U << DSI_REG_ANA_BG_VREF_EN_LEN) - 1) << DSI_REG_ANA_BG_VREF_EN_POS)
#define DSI_REG_ANA_BG_VREF_EN_UMSK         (~(((1U << DSI_REG_ANA_BG_VREF_EN_LEN) - 1) << DSI_REG_ANA_BG_VREF_EN_POS))
#define DSI_REG_ANA_VREG400MV_TRIM          DSI_REG_ANA_VREG400MV_TRIM
#define DSI_REG_ANA_VREG400MV_TRIM_POS      (24U)
#define DSI_REG_ANA_VREG400MV_TRIM_LEN      (3U)
#define DSI_REG_ANA_VREG400MV_TRIM_MSK      (((1U << DSI_REG_ANA_VREG400MV_TRIM_LEN) - 1) << DSI_REG_ANA_VREG400MV_TRIM_POS)
#define DSI_REG_ANA_VREG400MV_TRIM_UMSK     (~(((1U << DSI_REG_ANA_VREG400MV_TRIM_LEN) - 1) << DSI_REG_ANA_VREG400MV_TRIM_POS))
#define DSI_REG_ANA_VREF_EN                 DSI_REG_ANA_VREF_EN
#define DSI_REG_ANA_VREF_EN_POS             (27U)
#define DSI_REG_ANA_VREF_EN_LEN             (1U)
#define DSI_REG_ANA_VREF_EN_MSK             (((1U << DSI_REG_ANA_VREF_EN_LEN) - 1) << DSI_REG_ANA_VREF_EN_POS)
#define DSI_REG_ANA_VREF_EN_UMSK            (~(((1U << DSI_REG_ANA_VREF_EN_LEN) - 1) << DSI_REG_ANA_VREF_EN_POS))

/* 0xAC : dphy_config_11 */
#define DSI_DPHY_CONFIG_11_OFFSET (0xAC)
#define DSI_REG_DSI_ANA_0         DSI_REG_DSI_ANA_0
#define DSI_REG_DSI_ANA_0_POS     (0U)
#define DSI_REG_DSI_ANA_0_LEN     (16U)
#define DSI_REG_DSI_ANA_0_MSK     (((1U << DSI_REG_DSI_ANA_0_LEN) - 1) << DSI_REG_DSI_ANA_0_POS)
#define DSI_REG_DSI_ANA_0_UMSK    (~(((1U << DSI_REG_DSI_ANA_0_LEN) - 1) << DSI_REG_DSI_ANA_0_POS))
#define DSI_REG_DSI_ANA_1         DSI_REG_DSI_ANA_1
#define DSI_REG_DSI_ANA_1_POS     (16U)
#define DSI_REG_DSI_ANA_1_LEN     (16U)
#define DSI_REG_DSI_ANA_1_MSK     (((1U << DSI_REG_DSI_ANA_1_LEN) - 1) << DSI_REG_DSI_ANA_1_POS)
#define DSI_REG_DSI_ANA_1_UMSK    (~(((1U << DSI_REG_DSI_ANA_1_LEN) - 1) << DSI_REG_DSI_ANA_1_POS))

/* 0xB0 : dphy_config_12 */
#define DSI_DPHY_CONFIG_12_OFFSET (0xB0)
#define DSI_REG_DSI_ANA_2         DSI_REG_DSI_ANA_2
#define DSI_REG_DSI_ANA_2_POS     (0U)
#define DSI_REG_DSI_ANA_2_LEN     (16U)
#define DSI_REG_DSI_ANA_2_MSK     (((1U << DSI_REG_DSI_ANA_2_LEN) - 1) << DSI_REG_DSI_ANA_2_POS)
#define DSI_REG_DSI_ANA_2_UMSK    (~(((1U << DSI_REG_DSI_ANA_2_LEN) - 1) << DSI_REG_DSI_ANA_2_POS))

