RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsi_reg.h
/* 0xB4 : dphy_config_13 */
#define DSI_DPHY_CONFIG_13_OFFSET    (0xB4)
#define DSI_REG_RD_DIG_TEST_BUS      DSI_REG_RD_DIG_TEST_BUS
#define DSI_REG_RD_DIG_TEST_BUS_POS  (0U)
#define DSI_REG_RD_DIG_TEST_BUS_LEN  (16U)
#define DSI_REG_RD_DIG_TEST_BUS_MSK  (((1U << DSI_REG_RD_DIG_TEST_BUS_LEN) - 1) << DSI_REG_RD_DIG_TEST_BUS_POS)
#define DSI_REG_RD_DIG_TEST_BUS_UMSK (~(((1U << DSI_REG_RD_DIG_TEST_BUS_LEN) - 1) << DSI_REG_RD_DIG_TEST_BUS_POS))

/* 0xB8 : dphy_config_14 */
#define DSI_DPHY_CONFIG_14_OFFSET    (0xB8)
#define DSI_REG_PT_FREE_REP_PAT      DSI_REG_PT_FREE_REP_PAT
#define DSI_REG_PT_FREE_REP_PAT_POS  (0U)
#define DSI_REG_PT_FREE_REP_PAT_LEN  (32U)
#define DSI_REG_PT_FREE_REP_PAT_MSK  (((1U << DSI_REG_PT_FREE_REP_PAT_LEN) - 1) << DSI_REG_PT_FREE_REP_PAT_POS)
#define DSI_REG_PT_FREE_REP_PAT_UMSK (~(((1U << DSI_REG_PT_FREE_REP_PAT_LEN) - 1) << DSI_REG_PT_FREE_REP_PAT_POS))

/* 0xBC : dphy_config_15 */
#define DSI_DPHY_CONFIG_15_OFFSET      (0xBC)
#define DSI_REG_DSI_DC_TP_OUT_EN       DSI_REG_DSI_DC_TP_OUT_EN
#define DSI_REG_DSI_DC_TP_OUT_EN_POS   (0U)
#define DSI_REG_DSI_DC_TP_OUT_EN_LEN   (1U)
#define DSI_REG_DSI_DC_TP_OUT_EN_MSK   (((1U << DSI_REG_DSI_DC_TP_OUT_EN_LEN) - 1) << DSI_REG_DSI_DC_TP_OUT_EN_POS)
#define DSI_REG_DSI_DC_TP_OUT_EN_UMSK  (~(((1U << DSI_REG_DSI_DC_TP_OUT_EN_LEN) - 1) << DSI_REG_DSI_DC_TP_OUT_EN_POS))
#define DSI_REG_DSI_PW_AVDD1815        DSI_REG_DSI_PW_AVDD1815
#define DSI_REG_DSI_PW_AVDD1815_POS    (4U)
#define DSI_REG_DSI_PW_AVDD1815_LEN    (1U)
#define DSI_REG_DSI_PW_AVDD1815_MSK    (((1U << DSI_REG_DSI_PW_AVDD1815_LEN) - 1) << DSI_REG_DSI_PW_AVDD1815_POS)
#define DSI_REG_DSI_PW_AVDD1815_UMSK   (~(((1U << DSI_REG_DSI_PW_AVDD1815_LEN) - 1) << DSI_REG_DSI_PW_AVDD1815_POS))
#define DSI_REG_DPHY_PU_LDO11          DSI_REG_DPHY_PU_LDO11
#define DSI_REG_DPHY_PU_LDO11_POS      (8U)
#define DSI_REG_DPHY_PU_LDO11_LEN      (1U)
#define DSI_REG_DPHY_PU_LDO11_MSK      (((1U << DSI_REG_DPHY_PU_LDO11_LEN) - 1) << DSI_REG_DPHY_PU_LDO11_POS)
#define DSI_REG_DPHY_PU_LDO11_UMSK     (~(((1U << DSI_REG_DPHY_PU_LDO11_LEN) - 1) << DSI_REG_DPHY_PU_LDO11_POS))
#define DSI_REG_DPHY_SHORT_LDO11       DSI_REG_DPHY_SHORT_LDO11
#define DSI_REG_DPHY_SHORT_LDO11_POS   (12U)
#define DSI_REG_DPHY_SHORT_LDO11_LEN   (1U)
#define DSI_REG_DPHY_SHORT_LDO11_MSK   (((1U << DSI_REG_DPHY_SHORT_LDO11_LEN) - 1) << DSI_REG_DPHY_SHORT_LDO11_POS)
#define DSI_REG_DPHY_SHORT_LDO11_UMSK  (~(((1U << DSI_REG_DPHY_SHORT_LDO11_LEN) - 1) << DSI_REG_DPHY_SHORT_LDO11_POS))
#define DSI_REG_DPHY_LDO11_RFB_SW      DSI_REG_DPHY_LDO11_RFB_SW
#define DSI_REG_DPHY_LDO11_RFB_SW_POS  (16U)
#define DSI_REG_DPHY_LDO11_RFB_SW_LEN  (3U)
#define DSI_REG_DPHY_LDO11_RFB_SW_MSK  (((1U << DSI_REG_DPHY_LDO11_RFB_SW_LEN) - 1) << DSI_REG_DPHY_LDO11_RFB_SW_POS)
#define DSI_REG_DPHY_LDO11_RFB_SW_UMSK (~(((1U << DSI_REG_DPHY_LDO11_RFB_SW_LEN) - 1) << DSI_REG_DPHY_LDO11_RFB_SW_POS))
#define DSI_REG_TEN_DSI_LDO            DSI_REG_TEN_DSI_LDO
#define DSI_REG_TEN_DSI_LDO_POS        (20U)
#define DSI_REG_TEN_DSI_LDO_LEN        (1U)
#define DSI_REG_TEN_DSI_LDO_MSK        (((1U << DSI_REG_TEN_DSI_LDO_LEN) - 1) << DSI_REG_TEN_DSI_LDO_POS)
#define DSI_REG_TEN_DSI_LDO_UMSK       (~(((1U << DSI_REG_TEN_DSI_LDO_LEN) - 1) << DSI_REG_TEN_DSI_LDO_POS))
#define DSI_REG_MIPI_LDO_FAST          DSI_REG_MIPI_LDO_FAST
#define DSI_REG_MIPI_LDO_FAST_POS      (24U)
#define DSI_REG_MIPI_LDO_FAST_LEN      (1U)
#define DSI_REG_MIPI_LDO_FAST_MSK      (((1U << DSI_REG_MIPI_LDO_FAST_LEN) - 1) << DSI_REG_MIPI_LDO_FAST_POS)
#define DSI_REG_MIPI_LDO_FAST_UMSK     (~(((1U << DSI_REG_MIPI_LDO_FAST_LEN) - 1) << DSI_REG_MIPI_LDO_FAST_POS))
#define DSI_REG_DSI_RST_N_PRE          DSI_REG_DSI_RST_N_PRE
#define DSI_REG_DSI_RST_N_PRE_POS      (28U)
#define DSI_REG_DSI_RST_N_PRE_LEN      (1U)
#define DSI_REG_DSI_RST_N_PRE_MSK      (((1U << DSI_REG_DSI_RST_N_PRE_LEN) - 1) << DSI_REG_DSI_RST_N_PRE_POS)
#define DSI_REG_DSI_RST_N_PRE_UMSK     (~(((1U << DSI_REG_DSI_RST_N_PRE_LEN) - 1) << DSI_REG_DSI_RST_N_PRE_POS))
#define DSI_REG_CSI_RST_N_PRE          DSI_REG_CSI_RST_N_PRE
#define DSI_REG_CSI_RST_N_PRE_POS      (29U)
#define DSI_REG_CSI_RST_N_PRE_LEN      (1U)
#define DSI_REG_CSI_RST_N_PRE_MSK      (((1U << DSI_REG_CSI_RST_N_PRE_LEN) - 1) << DSI_REG_CSI_RST_N_PRE_POS)
#define DSI_REG_CSI_RST_N_PRE_UMSK     (~(((1U << DSI_REG_CSI_RST_N_PRE_LEN) - 1) << DSI_REG_CSI_RST_N_PRE_POS))

/* 0xC0 : dphy_config_16 */
#define DSI_DPHY_CONFIG_16_OFFSET     (0xC0)
#define DSI_REG_DSI_BYTE_CLK_INV      DSI_REG_DSI_BYTE_CLK_INV
#define DSI_REG_DSI_BYTE_CLK_INV_POS  (0U)
#define DSI_REG_DSI_BYTE_CLK_INV_LEN  (1U)
#define DSI_REG_DSI_BYTE_CLK_INV_MSK  (((1U << DSI_REG_DSI_BYTE_CLK_INV_LEN) - 1) << DSI_REG_DSI_BYTE_CLK_INV_POS)
#define DSI_REG_DSI_BYTE_CLK_INV_UMSK (~(((1U << DSI_REG_DSI_BYTE_CLK_INV_LEN) - 1) << DSI_REG_DSI_BYTE_CLK_INV_POS))
#define DSI_REG_DSI_LPRX_CLK_INV      DSI_REG_DSI_LPRX_CLK_INV
#define DSI_REG_DSI_LPRX_CLK_INV_POS  (1U)
#define DSI_REG_DSI_LPRX_CLK_INV_LEN  (1U)
#define DSI_REG_DSI_LPRX_CLK_INV_MSK  (((1U << DSI_REG_DSI_LPRX_CLK_INV_LEN) - 1) << DSI_REG_DSI_LPRX_CLK_INV_POS)
#define DSI_REG_DSI_LPRX_CLK_INV_UMSK (~(((1U << DSI_REG_DSI_LPRX_CLK_INV_LEN) - 1) << DSI_REG_DSI_LPRX_CLK_INV_POS))

/* 0xFC : dummy_reg */
#define DSI_DUMMY_REG_OFFSET (0xFC)
#define DSI_DUMMY_REG        DSI_DUMMY_REG
#define DSI_DUMMY_REG_POS    (0U)
#define DSI_DUMMY_REG_LEN    (32U)
#define DSI_DUMMY_REG_MSK    (((1U << DSI_DUMMY_REG_LEN) - 1) << DSI_DUMMY_REG_POS)
#define DSI_DUMMY_REG_UMSK   (~(((1U << DSI_DUMMY_REG_LEN) - 1) << DSI_DUMMY_REG_POS))

struct dsi_reg {
    /* 0x0 : dsi_config */
    union {
        struct {
            uint32_t cr_hstx_en      : 1; /* [    0],        r/w,        0x0 */
            uint32_t cr_lane_num     : 2; /* [ 2: 1],        r/w,        0x0 */
            uint32_t reserved_3      : 1; /* [    3],       rsvd,        0x0 */
            uint32_t cr_hstx_mode    : 1; /* [    4],        r/w,        0x1 */
            uint32_t cr_lse_pkt_en   : 1; /* [    5],        r/w,        0x0 */
            uint32_t cr_lane_mux_sel : 2; /* [ 7: 6],        r/w,        0x0 */
            uint32_t cr_dt           : 6; /* [13: 8],        r/w,       0x3e */
            uint32_t cr_vc           : 2; /* [15:14],        r/w,        0x0 */
            uint32_t cr_hstx_vfp     : 8; /* [23:16],        r/w,        0x2 */
            uint32_t cr_hstx_vsa     : 8; /* [31:24],        r/w,        0x2 */
        } BF;
        uint32_t WORD;
    } dsi_config;

