RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsi_reg.h
    /* 0x4 : dsi_esc_config */
    union {
        struct {
            uint32_t cr_esc_tx_en        : 1; /* [    0],        w1p,        0x0 */
            uint32_t cr_esc_tx_mode      : 2; /* [ 2: 1],        r/w,        0x0 */
            uint32_t cr_esc_tx_ulps_exit : 1; /* [    3],        w1p,        0x0 */
            uint32_t cr_esc_tx_trig      : 4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t reserved_8_15       : 8; /* [15: 8],       rsvd,        0x0 */
            uint32_t cr_esc_rx_en        : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_23      : 7; /* [23:17],       rsvd,        0x0 */
            uint32_t st_esc_rx_len       : 8; /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } dsi_esc_config;

    /* 0x8 : dsi_lpdt_tx_config */
    union {
        struct {
            uint32_t cr_lpdt_pdlen : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t cr_lpdt_vc    : 2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t cr_lpdt_di    : 6; /* [15:10],        r/w,        0x0 */
            uint32_t cr_lpdt_word0 : 8; /* [23:16],        r/w,        0x0 */
            uint32_t cr_lpdt_word1 : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dsi_lpdt_tx_config;

    /* 0xC : dsi_hstx_config */
    union {
        struct {
            uint32_t cr_hstx_pc     : 11; /* [10: 0],        r/w,      0x500 */
            uint32_t reserved_11_15 : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t cr_hstx_out_th : 11; /* [26:16],        r/w,      0x348 */
            uint32_t reserved_27_31 : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dsi_hstx_config;

    /* 0x10 : dsi_int_status */
    union {
        struct {
            uint32_t dsi_int_status : 14; /* [13: 0],          r,        0x0 */
            uint32_t reserved_14_31 : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dsi_int_status;

    /* 0x14 : dsi_int_mask */
    union {
        struct {
            uint32_t dsi_int_mask   : 14; /* [13: 0],        r/w,     0x3fff */
            uint32_t reserved_14_31 : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dsi_int_mask;

    /* 0x18 : dsi_int_clear */
    union {
        struct {
            uint32_t dsi_int_clear  : 14; /* [13: 0],        w1p,        0x0 */
            uint32_t reserved_14_31 : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dsi_int_clear;

    /* 0x1C : dsi_int_enable */
    union {
        struct {
            uint32_t dsi_int_enable : 14; /* [13: 0],        r/w,     0x3fff */
            uint32_t reserved_14_31 : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dsi_int_enable;

    /* 0x20 : dsi_frame_num */
    union {
        struct {
            uint32_t cr_frame_num   : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_30 : 15; /* [30:16],       rsvd,        0x0 */
            uint32_t cr_frame_upd   : 1;  /* [   31],        w1p,        0x0 */
        } BF;
        uint32_t WORD;
    } dsi_frame_num;

    /* 0x24  reserved */
    uint8_t RESERVED0x24[60];

    /* 0x60 : dsi_fifo_config_0 */
    union {
        struct {
            uint32_t dsi_dma_tx_en     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t dsi_dma_rx_en     : 1;  /* [    1],        r/w,        0x0 */
            uint32_t tx_fifo_clr       : 1;  /* [    2],        w1p,        0x0 */
            uint32_t rx_fifo_clr       : 1;  /* [    3],        w1p,        0x0 */
            uint32_t tx_fifo_overflow  : 1;  /* [    4],          r,        0x0 */
            uint32_t tx_fifo_underflow : 1;  /* [    5],          r,        0x0 */
            uint32_t rx_fifo_overflow  : 1;  /* [    6],          r,        0x0 */
            uint32_t rx_fifo_underflow : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dsi_fifo_config_0;

    /* 0x64 : dsi_fifo_config_1 */
    union {
        struct {
            uint32_t tx_fifo_cnt    : 3; /* [ 2: 0],          r,        0x4 */
            uint32_t reserved_3_7   : 5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t rx_fifo_cnt    : 3; /* [10: 8],          r,        0x0 */
            uint32_t reserved_11_15 : 5; /* [15:11],       rsvd,        0x0 */
            uint32_t tx_fifo_th     : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_23 : 6; /* [23:18],       rsvd,        0x0 */
            uint32_t rx_fifo_th     : 2; /* [25:24],        r/w,        0x0 */
            uint32_t reserved_26_31 : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dsi_fifo_config_1;

    /* 0x68 : dsi_fifo_wdata */
    union {
        struct {
            uint32_t dsi_fifo_wdata : 32; /* [31: 0],          w,          x */
        } BF;
        uint32_t WORD;
    } dsi_fifo_wdata;

    /* 0x6C : dsi_fifo_rdata */
    union {
        struct {
            uint32_t dsi_fifo_rdata : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } dsi_fifo_rdata;

    /* 0x70  reserved */
    uint8_t RESERVED0x70[16];

    /* 0x80 : dphy_config_0 */
    union {
        struct {
            uint32_t cl_enable           : 1; /* [    0],        r/w,        0x0 */
            uint32_t cl_txrequesths      : 1; /* [    1],        r/w,        0x0 */
            uint32_t cl_txulpsclk        : 1; /* [    2],        r/w,        0x0 */
            uint32_t cl_txulpsexit       : 1; /* [    3],        w1p,        0x0 */
            uint32_t cl_stopstate        : 1; /* [    4],          r,        0x1 */
            uint32_t cl_ulpsactivenot    : 1; /* [    5],          r,        0x1 */
            uint32_t reserved_6_7        : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t dl0_enable          : 1; /* [    8],        r/w,        0x0 */
            uint32_t dl1_enable          : 1; /* [    9],        r/w,        0x0 */
            uint32_t dl2_enable          : 1; /* [   10],        r/w,        0x0 */
            uint32_t dl3_enable          : 1; /* [   11],        r/w,        0x0 */
            uint32_t dl0_stopstate       : 1; /* [   12],          r,        0x1 */
            uint32_t dl1_stopstate       : 1; /* [   13],          r,        0x1 */
            uint32_t dl2_stopstate       : 1; /* [   14],          r,        0x1 */
            uint32_t dl3_stopstate       : 1; /* [   15],          r,        0x1 */
            uint32_t dl0_ulpsactivenot   : 1; /* [   16],          r,        0x1 */
            uint32_t dl1_ulpsactivenot   : 1; /* [   17],          r,        0x1 */
            uint32_t dl2_ulpsactivenot   : 1; /* [   18],          r,        0x1 */
            uint32_t dl3_ulpsactivenot   : 1; /* [   19],          r,        0x1 */
            uint32_t dl0_forcerxmode     : 1; /* [   20],        r/w,        0x0 */
            uint32_t dl1_forcerxmode     : 1; /* [   21],        r/w,        0x0 */
            uint32_t dl2_forcerxmode     : 1; /* [   22],        r/w,        0x0 */
            uint32_t dl3_forcerxmode     : 1; /* [   23],        r/w,        0x0 */
            uint32_t dl0_forcetxstopmode : 1; /* [   24],        r/w,        0x0 */
            uint32_t dl1_forcetxstopmode : 1; /* [   25],        r/w,        0x0 */
            uint32_t dl2_forcetxstopmode : 1; /* [   26],        r/w,        0x0 */
            uint32_t dl3_forcetxstopmode : 1; /* [   27],        r/w,        0x0 */
            uint32_t reserved_28_29      : 2; /* [29:28],       rsvd,        0x0 */
            uint32_t dl0_turnesc         : 1; /* [   30],        w1p,        0x0 */
            uint32_t dsi_reset_n         : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_0;

    /* 0x84 : dphy_config_1 */
    union {
        struct {
            uint32_t reg_time_ck_zero    : 8; /* [ 7: 0],        r/w,        0xf */
            uint32_t reg_time_ck_trail   : 8; /* [15: 8],        r/w,        0x3 */
            uint32_t reg_time_ck_exit    : 8; /* [23:16],        r/w,        0x5 */
            uint32_t reg_en_lprx_at_ulps : 1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31      : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_1;

    /* 0x88 : dphy_config_2 */
    union {
        struct {
            uint32_t reg_time_hs_zero  : 8; /* [ 7: 0],        r/w,        0x5 */
            uint32_t reg_time_hs_trail : 8; /* [15: 8],        r/w,        0x3 */
            uint32_t reg_time_hs_prep  : 8; /* [23:16],        r/w,        0x2 */
            uint32_t reg_time_hs_exit  : 8; /* [31:24],        r/w,        0x5 */
        } BF;
        uint32_t WORD;
    } dphy_config_2;

    /* 0x8C : dphy_config_3 */
    union {
        struct {
            uint32_t reg_time_ta_go  : 8; /* [ 7: 0],        r/w,        0xc */
            uint32_t reg_time_ta_get : 8; /* [15: 8],        r/w,        0xf */
            uint32_t reg_time_reqrdy : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_time_lpx    : 8; /* [31:24],        r/w,        0x3 */
        } BF;
        uint32_t WORD;
    } dphy_config_3;

    /* 0x90 : dphy_config_4 */
    union {
        struct {
            uint32_t reg_time_wakeup : 16; /* [15: 0],        r/w,     0x9c41 */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_4;

    /* 0x94 : dphy_config_5 */
    union {
        struct {
            uint32_t reg_trig3_code : 8; /* [ 7: 0],        r/w,        0x5 */
            uint32_t reg_trig2_code : 8; /* [15: 8],        r/w,       0x84 */
            uint32_t reg_trig1_code : 8; /* [23:16],        r/w,       0xba */
            uint32_t reg_trig0_code : 8; /* [31:24],        r/w,       0x46 */
        } BF;
        uint32_t WORD;
    } dphy_config_5;

    /* 0x98 : dphy_config_6 */
    union {
        struct {
            uint32_t reg_ulps_code  : 8;  /* [ 7: 0],        r/w,       0x78 */
            uint32_t reg_lpdt_code  : 8;  /* [15: 8],        r/w,       0x87 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_6;

    /* 0x9C : dphy_config_7 */
    union {
        struct {
            uint32_t reg_ana_test_en                 : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_pt_en                       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reg_pt_lp_mode                  : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reg_pt_prbs_or_jitt             : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reg_force_hiz_lp                : 4;  /* [ 7: 4],        r/w,        0x0 */
            uint32_t reg_force_hiz_hs                : 4;  /* [11: 8],        r/w,        0x0 */
            uint32_t reg_force_clk_hiz_lp            : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reg_force_clk_hiz_hs            : 1;  /* [   13],        r/w,        0x0 */
            uint32_t reg_ana_lp_txen_clklane_esc     : 1;  /* [   14],        r/w,        0x0 */
            uint32_t reg_ana_lp_dptxdata_clklane_esc : 1;  /* [   15],        r/w,        0x0 */
            uint32_t reg_ana_lp_dntxdata_clklane_esc : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reg_ana_hs_txen_clklane_esc     : 1;  /* [   17],        r/w,        0x0 */
            uint32_t reg_ana_clk_en_esc              : 1;  /* [   18],        r/w,        0x0 */
            uint32_t reg_ana_byte_rev                : 1;  /* [   19],        r/w,        0x0 */
            uint32_t reserved_20_31                  : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_7;

    /* 0xA0 : dphy_config_8 */
    union {
        struct {
            uint32_t reg_ana_lptxp_data      : 4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t reg_ana_lptxn_data      : 4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t reg_ana_lptxen          : 4; /* [11: 8],        r/w,        0x0 */
            uint32_t reg_ana_lprxen          : 4; /* [15:12],        r/w,        0x0 */
            uint32_t reg_ana_hstxen          : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_ana_hs_trail_byte   : 4; /* [23:20],        r/w,        0x0 */
            uint32_t reg_ana_hs_sync_ld_byte : 4; /* [27:24],        r/w,        0x0 */
            uint32_t reg_ana_hs_p2s_sel_byte : 4; /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_8;

    /* 0xA4 : dphy_config_9 */
    union {
        struct {
            uint32_t reg_ana_hs_data_out_byte : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_9;

    /* 0xA8 : dphy_config_10 */
    union {
        struct {
            uint32_t reg_testbus_sel_lo         : 4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t reg_testbus_sel_hi         : 4; /* [ 7: 4],        r/w,        0x0 */
            uint32_t reg_testbus_hi8bsel_8bmode : 1; /* [    8],        r/w,        0x0 */
            uint32_t reg_imp_pu_code            : 5; /* [13: 9],        r/w,        0x8 */
            uint32_t reg_imp_pd_code            : 5; /* [18:14],        r/w,        0x9 */
            uint32_t reg_dphy_vreg400mv_trim    : 3; /* [21:19],        r/w,        0x0 */
            uint32_t reg_dphy_bg_vref_en        : 1; /* [   22],        r/w,        0x0 */
            uint32_t reg_ana_bg_vref_en         : 1; /* [   23],        r/w,        0x0 */
            uint32_t reg_ana_vreg400mv_trim     : 3; /* [26:24],        r/w,        0x0 */
            uint32_t reg_ana_vref_en            : 1; /* [   27],        r/w,        0x0 */
            uint32_t reserved_28_31             : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_10;

    /* 0xAC : dphy_config_11 */
    union {
        struct {
            uint32_t reg_dsi_ana_0 : 16; /* [15: 0],        r/w,      0xc14 */
            uint32_t reg_dsi_ana_1 : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_11;

    /* 0xB0 : dphy_config_12 */
    union {
        struct {
            uint32_t reg_dsi_ana_2  : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_12;

