RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/dsi_reg.h
    /* 0xB4 : dphy_config_13 */
    union {
        struct {
            uint32_t reg_rd_dig_test_bus : 16; /* [15: 0],          r,        0x0 */
            uint32_t reserved_16_31      : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_13;

    /* 0xB8 : dphy_config_14 */
    union {
        struct {
            uint32_t reg_pt_free_rep_pat : 32; /* [31: 0],        r/w, 0x87654321 */
        } BF;
        uint32_t WORD;
    } dphy_config_14;

    /* 0xBC : dphy_config_15 */
    union {
        struct {
            uint32_t reg_dsi_dc_tp_out_en  : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3          : 3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t reg_dsi_pw_avdd1815   : 1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7          : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t reg_dphy_pu_ldo11     : 1; /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_11         : 3; /* [11: 9],       rsvd,        0x0 */
            uint32_t reg_dphy_short_ldo11  : 1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15        : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_dphy_ldo11_rfb_sw : 3; /* [18:16],        r/w,        0x4 */
            uint32_t reserved_19           : 1; /* [   19],       rsvd,        0x0 */
            uint32_t reg_ten_dsi_ldo       : 1; /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_23        : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t reg_mipi_ldo_fast     : 1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_27        : 3; /* [27:25],       rsvd,        0x0 */
            uint32_t reg_dsi_rst_n_pre     : 1; /* [   28],        r/w,        0x0 */
            uint32_t reg_csi_rst_n_pre     : 1; /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31        : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_15;

    /* 0xC0 : dphy_config_16 */
    union {
        struct {
            uint32_t reg_dsi_byte_clk_inv : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_dsi_lprx_clk_inv : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_31        : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dphy_config_16;

    /* 0xc4  reserved */
    uint8_t RESERVED0xc4[56];

    /* 0xFC : dummy_reg */
    union {
        struct {
            uint32_t dummy_reg : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dummy_reg;
};

typedef volatile struct dsi_reg dsi_reg_t;

#endif /* __DSI_REG_H__ */
